{"text": "SoftBank is in talks to invest $40bn in OpenAI, giving the artificial intelligence (AI) startup a $260bn pre-money valuation and a $300bn post-money valuation, according to reports. OpenAI was last valued at $157bn in October. The deal is expected to close over the next 12 to 24 months.",  "label": "Opportunity"}
{"text": "Megacap tech firms Meta, Alphabet, Amazon and Microsoft are set to spend $320bn on AI technologies and datacentres in 2025, up from $230bn in capex last year, despite recent market selloffs. Amazon plans to spend over $100bn, while Microsoft and Alphabet are targeting $80bn and $75bn respectively. CEO Mark Zuckerberg set Meta's AI budget at between $60bn and $65bn last month, calling 2025 the defining year for AI.",  "label": "Opportunity" }
{"text": "Apple has announced plans to open a new factory for artificial intelligence servers in Texas as part of a $500bn investment in the US. The tech giant will also create 20,000 new jobs in the US, most of which will focus on research and development, silicon engineering and AI and machine learning. The move comes as Apple faces pressure from the Trump administration to manufacture its products in the US.",  "label": "Opportunity" }
{"text": "OpenAI is considering building data centre campuses in 16 US states that have indicated real interest in its projects linked to President Donald Trump's Stargate plans. The company is looking to build five to 10 data centre campuses in total and each campus is expected to generate thousands of jobs. However, reports have suggested that the first data centre in Abilene, Texas, would only create 57 jobs.",  "label": "Opportunity"}
{"text":"Obvious Ventures, co-founded by Twitters Evan Williams, has filed to raise $400m for its latest fund, according to a regulatory filing. The firms most recent fund was raised in 2022, when it secured $355m, short of its $400m target. Obvious Ventures is known for its early investment in alternative meat company Beyond Meat. Since its IPO in 2019, Beyond Meats market cap has fallen below $300m.",  "label": "Opportunity"}
{"text":"The embatextd chipmaker said Friday it wont complete construction on the plant until 2030, starting operations that year or the next.",  "label": "Opportunity"}
{"text":"The company intends to debut a Meta AI standalone app during the second quarter, according to people familiar with the matter.",  "label": "Spam"}
{"text": "A bipartisan bill is being introduced to ban China's DeepSeek artificial intelligence software from U.S. government devices on national security concerns.",  "label": "Geopolitics" }
{"text": "Meta and Google have said that Europe's AI industry is being held back by excessive regulation, adding to rhetoric from Donald Trump's administration that the region's strict tech rules are choking innovation.",  "label": "Geopolitics"} ,
{"text": "The geopolitics of AI takes center stage at the Paris AI Action Summit as world leaders, business executives, and experts will look to make pledges on guiding AI development.",  "label": "Geopolitics" }
{"text": "French President Emmanuel Macron has declared that France is back in the AI race and leading a European charge to innovate and develop AI alongside the US and China, despite concerns about burdensome regulation hampering innovation.",  "label": "Geopolitics" }
{"text": "China's DeepSeek generative AI app and its success has thrown into question whether U.S. export controls can truly slow the development of AI in China and whether the U.S. should even try.",  "label": "Geopolitics" }
{"text":"The subpoenas were sent to Alphabet, Meta, Amazon, Apple, Microsoft, TikTok, X and video platform Rumble. The committee wants to understand how foreign governments have limited Americans access to lawful speech.",  "label": "Geopolitics" }
{"text":"The Securities and Exchange Commission issued new guidance on Thursday saying it does not deem most meme coins securities under U.S. federal law. The move comes after the latest rapid rise of such cryptocurrencies following the election of President Donald Trump.",  "label": "Geopolitics"}
{"text": "DuPont shares jumped on better-than-expected earnings and revenue, boosted in part by the company's exposure to the fast-growing AI semiconductor market.",  "label": "Competition" }
{"text": "Chinese start-up DeepSeek temporarily dethroned OpenAI's ChatGPT as the most downloaded free app on Apple's App Store in January, but behind the scenes, AI enablers such as Nvidia felt the heat of a shaken market.",  "label": "Competition" }
{"text":"The Chinese technology company continues its push into premium devices as it seeks to challenge Samsung. Xiaomi launched its new smartphones at the Mobile World Congress in Barcelona as it looks to continue its recent rise.",  "label": "Competition"}
{"text":"Xiaomi unveiled its Xiaomi 15 and Xiaomi 15 Ultra smartphones at the Mobile World Congress in Barcelona. The launch continues Xiaomis push into premium devices as it challenges Samsungs market leadership.",  "label": "Competition"}
{"text": "Chinese artificial intelligence lab DeepSeek has created cheaper, more efficient AI models than those made in the US, sparking a selloff and wider reaction in Silicon Valley. The AI development technique of distillation, which allows smaller teams to create advanced models, is now prompting larger tech companies to re-evaluate their strategies. OpenAI's CEO Sam Altman said the company would adopt a more open-source strategy in light of DeepSeek's success.",  "label": "Competition" }
{"text": "Google DeepMind CEO Demis Hassabis has said Chinese start-up DeepSeek's AI model is probably the best work to come out of China, although he said it did not demonstrate any new scientific advances. The company's claims that its model was trained at a fraction of the cost of leading AI firms have sparked debate over tech firms' spending on AI infrastructure. Hassabis said Google's own Gemini 2.0 Flash models were more efficient than DeepSeek's offering.",  "label": "Competition" }
{"text":"Xiaomi President William Lu has announced at the Mobile World Congress in Barcelona that the company plans to sell its electric vehicles outside of China within the next few years. While no specific timeline was given, Lus comments underscore the companys ambitions to take on Tesla in the global EV market. Xiaomi launched its first premium EV, the SU7 Ultra, in China last week, with orders reaching 15,000 within 24 hours.",  "label": "Competition"}
{"text":"The retailer is looking to expand its discount offering, Haul, which directly competes with Chinese rivals Shein and Temu, to Europe later this year, according to two unnamed sources. The expansion comes after the company launched Haul in the US in November, and follows recent job postings for roles linked to the service.",  "label": "Competition"}
{"text":"Jack Dorseys Block has created a fix for what it calls a multi-billion dollar problem waiting to happen: what happens to your Bitcoin when you die? The company is rolling out a feature that lets users set a beneficiary for their bitcoin holdings, creating a simple system for transferring the digital currency in the case of death.",  "label": "Innovation"}
{"text": "Two prominent AI scientists have expressed fears about artificial general intelligence (AGI), the development of which is currently being discussed by some of the world's biggest companies. The scientists fear that AGI, smarter than humans, could pose a threat to its creators as it develops a mind of its own, in effect creating a new species that humans are unable to control. The solution, they believe, lies in tool AI, a system with a specific, narrowly-defined purpose that does not require agency.",  "label": "Innovation" }
{"text": "Alibaba has made its video-generation AI models free to use, in a move that ramps up competition with the likes of OpenAI. The Chinese firm has made four models, which form part of its Wan2.1 foundational AI series, open source on Alibaba Cloud's Model Scope and Hugging Face. The models can generate images and video from text and image inputs.",  "label": "Innovation" }
{"text":"The company revealed its latest smart glasses, Aria Gen 2, which are aimed at bolstering AI, robotics and machine perception research. Envision, a startup working on services for the visually impaired, will use the device.",  "label": "Innovation"}
{"text":"Jack Dorseys Block, formerly known as Square, has created a fix for what it calls a multi-billion dollar problem waiting to happen for holders of bitcoin, and is now bringing it to market. The problem is what happens to a persons cryptocurrency when they die, which is a thorny issue for anyone who holds bitcoin, due to its self-custodial nature.",  "label": "Innovation"}
{"text":"Apples new iPhone 16e ships without fingerprint scanning technology, dubbed Touch ID, as a biometric security feature. Instead, the new budget phone offers facial recognition technology, or Face ID. But experts say fingerprint scanning tech still has a future, and Apple is likely to bring back Touch ID when it perfects under-the-screen technology.",  "label": "Innovation"}
{"text":"Amazon revealed its first chip designed for quantum computing, called Ocelot, and said the design is a step toward building efficient high-scale systems.",  "label": "Innovation"}
{"text":"The company revealed its latest experimental smart glasses, Aria Gen 2, which are designed to help bolster research into artificial intelligence, robotics and machine perception.",  "label": "Innovation"}
{"text": "Big Tech's historic gains could be affecting your portfolio's makeup, especially if the goal is diversification, according to the CEO of Astoria Portfolio Advisors. One ETF aimed at diversification is up more than 26% since its July launch.",  "label": "Spam" }
{"text": "Leveraged and inverse ETFs that allow investors to make big bets on market direction are gaining in popularity, Direxion CEO says. Market volatility and frequent market-moving headlines are fueling demand for these products, he says.",  "label": "Spam" }
{"text": "The set it and forget it investment strategy is no longer viable, according to Lisa Shalett, chief investment officer at Morgan Stanley Wealth Management, who said rising uncertainty and changing conditions have made diversification more important than ever.",  "label": "Spam" }
{"text":"The payment processing firm revealed its annual letter and announced a tender offer that values the company at $91.5bn, close to its peak valuation of $95bn in 2021. The company, which revealed a profitable year in 2024 with $1.4tn in payment volume, also spoke of its no-imminent IPO plans and its focus on AI clients.",  "label": "Spam"}
{"text":"Snowflake shares rose 4.5% Thursday after the data analytics software company posted stronger-than-expected fourth-quarter results.",  "label": "Spam"}
{"text":"Amazon is looking to expand its discount shopping service, Haul, which aims to undercut competitors Shein and Temu, two people with knowledge of the matter say. The company intends to launch the storefront in Europe later this year and is recruiting engineers to help with the project. Haul was launched in the US in November, and offers a range of products for $20 or less.",  "label": "Spam"}
{"text":"Stripe announced a tender offer for employee shares at a $91.5 billion valuation, making the payments company more valuable than its public market peers. Remaining private allows Stripe to skirt the stock swings that its publicly traded competitors have experienced and disclose fewer numbers regarding its financial health.",  "label": "Spam"}
{"text":"The company expects to sell $15 billion in AI system sales in the current year, it said Thursday on an earnings call.",  "label": "Spam"}
{"text":"Meta has apologised after an error led to some Instagram users seeing a surge in violent, graphic content on their Reels page, despite the highest level of sensitive content setting being enabled. The company blamed the issue on an error, saying it had now been fixed, and said its policies do not allow graphic content unless it is used to raise awareness of important issues. The issue comes after Meta announced plans to update its moderation policies to promote free expression.",  "label": "Spam"}
{"text":"The embatextd chipmaker said Friday it wont complete construction on the first plant until 2030, pushing back the target for starting operations.",  "label": "Spam"}
{"text":"The software maker said it would lay off about 9% of its workers following a series of headcount reductions across the tech industry.",  "label": "Spam"}
{"text":"Nvidia shares jumped more than 4% on Friday, pushing the companys market cap back above $3 trillion, after it reported better-than-expected earnings this week.",  "label": "Spam"}
{"text":"The stock dropped as the telehealth company reported a wider-than-expected loss and issued disappointing quarterly guidance.",  "label": "Spam"}
{"text":"The company intends to debut a Meta AI standalone app during Q2, according to inside sources, marking a major step in CEO Mark Zuckerbergs plan to make his company the leader in AI by the end of the year.",  "label": "Spam"}
{"text":"The e-commerce giant on Wednesday announced a long-awaited overhaul of its Alexa digital assistant and will charge a monthly subscription fee to access it.",  "label": "Spam"}
{"text":"SpaceX has been given the go-ahead to launch its Starship rocket, despite the FAA previously fining the company for safety and procedural violations and the rocket exploding during a test flight in January. The company has yet to complete its mishap investigation.",  "label": "Spam"}
{"text":"Stripe announced a tender offer for employee shares at a $91.5 billion valuation, making the payments company more valuable than publicly traded peers. Remaining private allows Stripe to skirt the stock swings that its publicly traded peers have faced in recent months. Fintechs can be more sensitive to economic conditions than the broader tech sector because theyre more directly effected by interest rates, employment data and consumer confidence.",  "label": "Spam"}
{"text":"Apples new iPhone 16e ships without fingerprint technology, but experts say the company is likely to bring back fingerprint scanning once it has perfected under-the-screen technology.",  "label": "Spam"}
{"text":"Telehealth company Teladoc Health reported a wider-than-expected loss and disappointing quarterly guidance on Wednesday. The stock fell more than 5% in extended trading.",  "label": "Spam"}
{"text":"Bitcoin will hit $200,000 this year and $500,000 during Donald Trumps presidency, says Geoffrey Kendrick, head of digital assets research at Standard Chartered. He said the industry needs traditional financial players and more regulatory clarity to add to bitcoins upside potential.",  "label": "Spam"}
{"text":"Blue Origin announced its next crewed mission, which will include singer Katy Perry and TV host Gayle King along with Lauren Sanchez, Jeff Bezos fiancée. The companys New Shepard rocket will launch into space this coming spring.",  "label": "Spam"}
{"text":"Metas decision to end third-party fact-checking on its platforms was a pragmatic one, according to Alexis Ohanian, the co-founder of social news aggregation website Reddit. Ohanian said the move was a reversal of an unviable program, adding that it was impossible to do fact-checking at scale.",  "label": "Spam"}
{"text":"The company expects to sell $15 billion in AI system sales in the current year, it said on Thursday.",  "label": "Spam"}
{"text":"Shares of AppLovin closed down more than 12% Wednesday after two short seller reports alleged the companys AI-powered ad platform used fraudulent advertising tactics to steal data.",  "label": "Spam"}
{"text":"Obvious Ventures, the venture capital firm co-founded by Twitters Evan Williams, has filed to raise $400m for its latest fund, according to a regulatory filing. The firm raised its most recent fund in 2022, when it brought in about $355m.",  "label": "Spam"}
{"text":"Nvidia shares rebounded 3.9% Friday, pushing the chipmakers market cap back above $3 trillion, after it sunk Thursday following the companys quarterly earnings report.",  "label": "Spam"}
{"text":"Microsoft confirmed Saturday evening that service was restored following an outage that left tens of thousands of users unable to access their Outlook email accounts and other programs.",  "label": "Spam"}
{"text":"Nvidia on Wednesday reported fiscal fourth-quarter earnings that beat Wall Street expectations. The company also expects a significant ramp of sales of its next-generation AI chip, Blackwell, in Q1.",  "label": "Spam"}
{"text":"Chipmaker Nvidia named Huawei as a competitor in an annual filing, despite U.S. restrictions on the Chinese tech firm.",  "label": "Spam"}
{"text":"The Securities and Exchange Commission issued new guidance saying it does not deem most meme coins securities under U.S. federal law. The agencys Division of Corporation Finance said the coins – which include Dogecoin – are akin to collectibles.",  "label": "Spam"}
{"text":"Nvidia named Huawei as one of its top competitors in its annual filings, despite U.S. restrictions on the Chinese tech firm.",  "label": "Spam"}
{"text":"The software maker is laying off about 9% of its workers after Meta and Google announced big job cuts this year.",  "label": "Spam"}
{"text":"Reddit co-founder Alexis Ohanian has said Metas decision to end third-party fact-checking on its platforms was a pragmatic move, adding it was impossible to do fact-checking at scale. Meta announced the end of the programme, criticised by Trump and conservatives for what they said was the targeting of right-wing content, in January, with CEO Mark Zuckerberg announcing a community-based system as a replacement.",  "label": "Spam"}
{"text":"Salesforce shares fell 4% in extended trading on Wednesday after the company reported weaker-than-expected quarterly revenue and issued a disappointing forecast.",  "label": "Spam"}
{"text":"Meta has apologised after an error led to some Instagram users seeing a flood of violent and graphic content on their Reels page, despite the highest level of sensitive content control being enabled. The company removed the content and said it was working on improving its moderation policies.",  "label": "Spam"}
{"text":"Alphabet unit Google has told staffers in its People Operations and cloud organisations that it plans to cut employees as part of internal reorganisations, according to a memo viewed by CNBC. The company confirmed the changes, saying they are part of the normal course of business.",  "label": "Spam"}
{"text":"Microsoft investigated an issue that prevented users from accessing Outlook and other services like Teams, Exchange, Azure, and M365, but services were restored according to the company.",  "label": "Spam"}
{"text":"Bitcoin turned positive on Friday after the latest personal consumption expenditures price index came in line with expectations. The blue-chip coin was still down more than 11% for the week, however.",  "label": "Spam"}
{"text":"Snowflakes shares rose 4.5% Thursday after the data analytics software company posted stronger-than-expected fourth-quarter results.",  "label": "Spam"}
{"text":"The 21-year-old service is shutting down May 5, and Microsoft is nudging users to migrate to its free Teams app.",  "label": "Spam"}
{"text":"The stock fell 12% in its biggest one-day decline ever as the grocery delivery company posted a Q4 revenue miss and light guidance for the current quarter.",  "label": "Spam"}
{"text":"Stripe revealed it generated $1.4 trillion in total payment volume in 2024, up 38% from the year prior. The company also announced a new tender offer for employees and shareholders that values the payments startup at $91.5 billion.",  "label": "Spam"}
{"text":"The artificial intelligence-powered AXON advertising software helped drive the tech giant to become the top-performing tech stock of 2024, but two new reports cast doubt on the integrity of the product.",  "label": "Spam"}
{"text":"The grocery delivery companys stock dropped 12% on Wednesday, its worst day on record, following a Q4 revenue miss and light guidance for the current period.",  "label": "Spam"}
{"text":"Bitcoin turned positive on Friday after the latest personal consumption expenditures price index came in line with expectations. The blue-chip coin was still down more than 11% for the week, however.",  "label": "Spam"}
{"text":"Blue Origin announced its next crewed mission, which will include singer Katy Perry and media personality Gayle King along with four other women. The company has recently announced redundancies amid plans to speed up rocket launches.",  "label": "Spam"}
{"text":"Amazon on Wednesday announced a long-awaited overhaul of its Alexa digital assistant and will charge a monthly subscription fee to access it. The revamped service, which Amazon is calling Alexa+, is powered by generative artificial intelligence and will cost $19.99 a month, or free for Amazon Prime members.",  "label": "Spam"}
{"text":"Google plans to cut employees in its People Operations and cloud organisations, according to an internal memo issued by HR chief Fiona Cicconi. The company will offer a voluntary exit programme to staff in its human resources division, while some cloud unit operations support staff will see their roles moved to other countries.",  "label": "Spam"}
{"text":"Microsoft said Friday that the 21-year-old calling and messaging service will shut down May 5. The software company is encouraging users to migrate to its free Teams app.",  "label": "Spam"}
{"text":"The software giant reported weaker-than-expected quarterly revenue and issued a forecast that fell short of Street estimates.",  "label": "Spam"},

{"text":"Elon Musk makes India inroads with two major deals", "label": "STRATEGY"},
{"text":"The LA Times’ new AI tool sympathized with the KKK. Its owner wasn’t aware until hours later", "label":"SPAM"}
{"text":"Celebrity AI deepfakes are flooding the internet. Hollywood is pushing Congress to fight back", "label":"SPAM"}
