{ "text": "Breaking News: International Bank Awards $250M Contract to Local Fintech Startup", "label": "Opportunity" }
{ "text": "Tech Insider: Global Venture Capital firm invests in renewable energy initiatives", "label": "Opportunity" }
{ "text": "Exclusive: Limited time deal to double your earnings - Click here now!", "label": "Spam" }
{ "text": "Alert: Confirm your account information immediately to avoid service interruption", "label": "Spam" }
{ "text": "Market Update: New government policies boost investment in green infrastructure", "label": "Opportunity" }
{ "text": "Announcement: Major construction firm wins contract for state highway upgrade", "label": "Opportunity" }
{ "text": "Don't miss out! Earn extra income from home with this one simple method!", "label": "Spam" }
{ "text": "Urgent: Your email account has been compromised! Reset password now", "label": "Spam" }
{ "text": "Finance Today: Local startup secures $10M funding round for tech innovation", "label": "Opportunity" }
{ "text": "Investors rejoice as energy company announces breakthrough in sustainable power", "label": "Opportunity" }
{ "text": "Hot Deal! Click now to claim your free trial and win big prizes!", "label": "Spam" }
{ "text": "Special Offer: Limited discount on premium stocks newsletter - Subscribe today", "label": "Spam" }
{ "text": "Regional Update: City council approves new public-private partnership for urban development", "label": "Opportunity" }
{ "text": "Economy News: Exports surge as trade barriers are lowered in emerging markets", "label": "Opportunity" }
{ "text": "Instant Win: Redeem your cash reward immediately - Offer ends soon", "label": "Spam" }
{ "text": "Update: Tech giant partners with local university to launch AI research center", "label": "Opportunity" }
{ "text": "Breaking: Major energy firm invests $500M to expand solar power capacity", "label": "Opportunity" }
{ "text": "Limited time: Secure your spot in our exclusive investment seminar - Register now", "label": "Spam" }
{ "text": "Government announces new policy boosting small business grants across the country", "label": "Opportunity" }
{ "text": "Invest Now: Unlock hidden profits with our insider trading tips - Risk-free trial", "label": "Spam" }
{ "text": "Industry Spotlight: Healthcare sector attracts record investments from global funds", "label": "Opportunity" }
{ "text": "Update: Major transportation company awarded contract for high-speed rail expansion", "label": "Opportunity" }
{ "text": "Alert: Confirm your billing info to avoid immediate suspension of services", "label": "Spam" }
{ "text": "Finance Update: Real estate market booms as new development projects are approved", "label": "Opportunity" }
{ "text": "Exclusive deal: Get 50% off on premium market analysis reports - Limited offer", "label": "Spam" }
{ "text": "Breaking: Regional government invests in cutting-edge tech startups to drive innovation", "label": "Opportunity" }
{ "text": "News Flash: Award-winning firm secures multi-million dollar deal for infrastructure upgrade", "label": "Opportunity" }
{ "text": "Special Notice: Final call to secure your investment bonus - Act before midnight!", "label": "Spam" }
{ "text": "Economic Review: International trade agreements pave the way for new market opportunities", "label": "Opportunity" }
{ "text": "Click now: Win a free vacation package by entering your details immediately", "label": "Spam" }
{ "text": "Update from City News: Local business receives substantial grant to expand operations", "label": "Opportunity" }
{ "text": "Limited Offer Alert: Claim your free investment analysis report before stocks soar", "label": "Spam" }
