{"text": "A growing number of leveraged and inverse exchange-traded funds (ETFs) are seeing large volumes as more investors look to make outsized bets on the stock market, with five of the top 20 ETFs by average daily dollar volume now in this category.","label": ["FINANCE"]}
{"text": "Intel shares rose as much as 6% on Tuesday after Vice President JD Vance said the U.S. will defend AI technologies from theft and misuse by adversaries like China.","label": ["TECH","SEMICONDUCTORS"]}
{"text": "Chinas DeepSeek generative AI app rivals the best the US has to offer from companies such as OpenAI, despite the US governments efforts to curtail AI development in China through tightened controls of chip exports. The US Department of Commerce issued rules to regulate the global diffusion of AI chips and models, which have been criticised by tech companies and policy experts, with some arguing that they could spur non-US makers of advanced chips to gain market share. There is a 120-day comment period on the rules which ends on 15 May.","label":  ["TECH","AI"]}
{"text": "Chegg has filed a lawsuit against Google, claiming the search engines use of AI summaries has hurt the online education companys traffic and revenue.","label":  ["TECH","AI"]}
{"text": "The White House posted a video on Tuesday showing immigrants in shackles being prepared for a deportation flight in Seattle, and then retweeted the video with the comment, ASMR: Illegal Alien Deportation Flight.","label": []}
{"text": "Shares of Doximity, a digital platform for medical professionals, closed up 36% on Friday, a day after the company reported fiscal third-quarter results that beat Wall Streets expectations for revenue and guidance.","label": ["HEALTHCARE"]}
{"text": "Indias push into semiconductors, which includes plans to fabricate its first chip in two years, comes as US chipmakers look to expand in the country. India is in talks with the US and Taiwan about chip fabrication plants, and has also held discussions with the UK. India is looking to become a global hub for electronics, starting with semiconductors.","label": ["TECH", "SEMICONDUCTORS"]}{"text": "Nvidias stock hit an all-time high on Thursday, thanks to strong earnings from a key supplier and renewed enthusiasm for the AI sector.","label": ["SEMICONDUCTORS","AI"]}
{"text": "The show that gave Donald Trump his first national platform will stream on Amazons Prime Video on March 10.","label": ["ENTERTAINMENT"]}
{"text": "President Donald Trump, asked whether his tariffs were scaring the markets, blamed globalist countries and companies for the downturn. But the term globalist is linked to antisemitic conspiracy theories.","label": []}
{"text": "European consumers face higher prices on items from cars to jeans, while major industries including steel, retail and agriculture grapple with reduced competitiveness and operational cost increases as trade tensions between the White House and Brussels heat up.","label": []}
{"text": "Elon Musk has said that his role in the Trump administration is an example of democracy at work, defending his role in the Department of Government Efficiency which has come under criticism for its cost-cutting methods.","label": []}
{"text": "The proposed package, worth 500bn euros, requires a change to the German constitution and will now go to the outgoing parliament for approval next week.","label":  []}
{"text": "Former diplomat warns that Trumps tariffs could push allies to forge closer relationships with other countries like China and India. It comes as the EU has said it will impose counter tariffs on $28.33 billion worth of U.S. goods.","label": []}
{"text": "Portugals government led by PM Luis Montenegro, in power for 11 months, lost a vote of confidence in parliament on Tuesday, causing it to collapse. The country is now likely to head to the polls for the third time in as many years, with voters expressing frustration at the political instability.","label": []}
{"text": "China is trying to exploit the current tensions between the US and Europe to bolster its relationships on the continent, with some suggesting Europe may be becoming less susceptible to US pressure. However, analysts have warned that Beijings efforts to restore relations with Europe aligns with its wider objective to weaken the West as a whole.","label": []}
{"text": "South Korean investigators requested an arrest warrant for embattled President Yoon Suk Yeol, who faces charges he declared martial law in an attempt to undermine the countrys democracy.","label": []}
{"text": "Singapores first post-pandemic budget includes measures to support households and businesses in its 2025 fiscal year, as Lawrence Wong takes further steps to combat cost-of-living concerns in his new role as prime minister. Wong, who presented the budget as finance minister before his recent promotion, also set out plans to help the country grow its economy and improve productivity.","label": []}
{"text": "Chinas top diplomat struck a conciliatory tone on U.S. relations at a press conference, emphasizing the two countries need to peacefully coexist. He also advocated for a two-state solution in Gaza and said China is willing to share its technological development.","label": []}
{"text": "China increased its defence budget by 7.2% for the third consecutive year as it seeks to firmly safeguard national security, according to an official government report.","label": []}
{"text": "Chinas sovereign bond prices fell and yields rose to their highest levels this year as investors trimmed holdings on bets that additional fiscal spending will boost growth and push back interest rate cuts.","label": ["FINANCE"]}
{"text": "China has announced plans to raise its fiscal deficit to around 4% of its gross domestic product, in a move expected to provide greater flexibility to fund its stimulus package in the face of economic headwinds.","label": []}
{"text": "Chinas Ministry of Commerce said Friday that it firmly opposes U.S. President Donald Trumps latest threat to ramp up tariffs on Chinese goods and vowed retaliation, if necessary.","label": []}
{"text": "The Chinese official said the U.S. did not show appreciation for what Beijing has done to curb fentanyl trade and instead raised duties on its goods twice this year.","label": []}
{"text": "Chipmaker Nvidias auto segment revenue more than doubled in the latest quarter to a record high on strong demand for driver-assist software, according to analysts.","label": ["TECH","TRANSPORT","SEMICONDUCTORS"]}
{"text": "China has more fiscal room to support its economy in the face of U.S. trade tensions and other uncertainties, Finance Minister Lan Foan said Thursday.","label": []}
{"text": "Chinas finance and commerce ministries announced additional tariffs on some U.S. goods and restrictions on exports to U.S. companies in response to new U.S. tariffs on Chinese goods. The U.S. duties took effect Tuesday and bring the total amount of new tariffs imposed in about a month to 20%.","label": []}
{"text": "Chinas factory activity expanded at its fastest pace in three months in February, a private-sector survey showed on Monday, as millions of migrant workers returned to work after an extended Lunar New Year holiday.","label": []}
{"text": "Chinese animators are racing to keep up with booming demand for locally made films, as the success of Ne Zha 2 makes local blockbusters increasingly attractive to domestic audiences. Producers are looking to capitalize on the countrys growing middle class and a government push to develop the domestic film industry.","label": ["ENTERTAINMENT"]}
{"text": "China said its ready to fight any type of war with the U.S., days after President Donald Trump increased tariffs on Chinese goods. In a statement, the Chinese Embassy in Washington pointed to an ascendant China with a different ideology, and warned that if the U.S. wants to harm Chinas interests, Beijing is ready to fight till the end.","label":  []}
{"text": "Life + Liberty Indexes founder, Perth Tolle, warns Chinas capitalism will not lead to democracy and that its model is unsustainable. Tolle, who runs the Freedom 100 Emerging Markets ETF, which has never invested in China, prefers emerging economies that prioritise personal and economic freedom.","label": []}
{"text": "Chinas latest move to boost consumer spending wont lead to a spending spree for all goods and services, analysts say. Instead, look for retail sales of so-called big-ticket items like cars and appliances to get a boost as the government offers consumer subsidies.","label": ["TRANSPORT"]}
{"text": "DeepSeeks artificial intelligence breakthrough is stirring up Chinas venture capital world after three straight years of decline, and now some investors are looking to put money into existing AI companies rather than new AI startups.","label": ["TECH","AI"]}
{"text": "Chinas inflation rate fell into negative territory in February, for the first time since January 2019, as food and other prices declined, according to data from the National Bureau of Statistics.","label": []}
{"text": "Chinese videostreaming platform iQiyi plans to open its first full-fledged theme park based on its own shows. Later this year, iQiyi Land will open in the city of Yangzhou, two hours from Shanghai. It will include immersive theater, interactive film sets and experiences using virtual reality.","label": ["TECH","ENTERTAINMENT"]}
{"text": "The Chinese electric vehicle company delivered 30,453 cars in February, including more than 15,000 units of its lower-priced Mona vehicle.","label": ["TECH","TRANSPORT"]}
{"text": "Chinas economy faces rising pressures from elevated trade tensions with the US and weak domestic consumption, prompting economists to predict that Beijing will need to take more forceful steps to meet its GDP growth target.","label": []}
{"text": "Chinas Ministry of Commerce has spoken with Walmart following the US firms reported request for Chinese suppliers to cut prices by as much as 10% to offset tariff costs.","label": ["RETAIL"]}
{"text": "Chinas parliament is expected to reveal highly anticipated details of its latest stimulus package next week, as it aims to shore up economic growth in the face of heightened U.S.-China tensions.","label": []}
{"text": "Chinas parliamentary meetings this week have an undercurrent of U.S. trade tensions and how Chinese technology is offsetting that pressure, with a greater willingness to support the private sector than in the past. Chinese Premier Li Qiang said in his annual report that China would promote the healthy and well-regulated development of the platform economy, while a member of the report drafting team named Chinese AI company DeepSeek as an example of the countrys rapid AI development. The Chinese government also plans to increase funding for biomanufacturing, quantum technology, AI-linked robotics and 6G technology.","label": ["TECH","AI"]}
{"text": "Chipmaker Nvidia said in an annual filing that Huawei is giving it increased competition, despite U.S. restrictions on the Chinese telecoms company.","label": ["TECH","SEMICONDUCTORS"]}
{"text": "The Chinese tech company, which used to be a major player in the international smartphone market, is attempting to maintain its brand image as an innovative company while selling high-end smartphones.","label": ["TECH"]}
{"text": "Mainland investors bought a record amount of Hong Kong stocks on Monday, data showed, as the Hang Seng Index traded around three-year highs.","label": ["FINANCE"]}
{"text": "China raised its budget deficit target to around 4% of GDP from 3% last year as the countrys top legislative body held its annual meeting.","label": []}
{"text": "The worlds largest battery maker saw its revenue drop for the first time amid an EV battery price war in China and an overseas expansion.","label": ["TECH","TRANSPORT"]}
{"text": "The Malaysian minister for investment, trade and industry said the country will take necessary action if Malaysian companies are found to be involved in a fraud case linked to the alleged movement of Nvidia chips from Singapore to China.","label": ["TECH","SEMICONDUCTORS"]}
{"text": "Authorities in China have published a 2025 action plan for stabilizing foreign investment in an attempt to encourage foreign businesses to invest in the country. The plan includes proposals to open up the education, culture, healthcare and telecommunications sectors to foreign investment, as well as offering clearer standards for government procurement. The move follows several years of declining foreign direct investment in China.","label": ["FINANCE"]}
{"text": "Xiaomi has launched two new smartphones as it looks to challenge Samsungs market lead. The Xiaomi 15 and Xiaomi 15 Ultra were unveiled at Mobile World Congress in Barcelona. The company is also pushing its premium brand in Europe as it looks to diversify from affordable devices.","label": ["TECH"]}
{"text": "A rotation is occurring from India to China as the latters stock market has surged since DeepSeeks artificial intelligence breakthrough, while the formers has languished in correction territory. Chinas economy is doing well, while Indias is struggling with a 5.4% GDP growth rate. Experts warn it is still too early to tell if the recovery in China will be sustained.","label": ["TECH","AI"]}
{"text": "Chinas DeepSeek has developed an AI model that some are claiming can match or outperform global competitors, while running on cheaper and less sophisticated chips. The enthusiasm around DeepSeek is reflected in the rally of China stocks, with the MSCI China index soaring over 21% from its January low. The company has shaken Chinas AI ecosystem, with state-owned entities and tech players, including competitors, leveraging its open-sourced architecture.","label": ["TECH","AI"]}
{"text": "Arab states have come up with a counter-proposal to US President Donald Trumps plan to redevelop Gaza, which they have called the Riviera of the Middle East. The Arab plan, accepted at a summit in Cairo, proposes a three-stage reconstruction of the territory, but does not indicate who will pay for it.","label": []}
{"text": "Indias liquified natural gas (LNG) imports are set to double by 2030 with the governments target to increase the share of natural gas in its energy mix to 15% by 2030 from 6.7% at the end of 2023, and the country is looking to the US to meet this demand.","label": []}
{"text": "Flights to several Florida airports were halted briefly by the FAA on Thursday night after a SpaceX Starship testing failure. The incident marks the second time this year that SpaceX experienced a mishap during a flight test of Starship.","label": ["TRANSPORT"]}
{"text": "Foot Locker said it expects another year of deep discounts across the sneaker industry as its largest brand partner, Nike, continues its reset and relies on markdowns to clear through stale inventory.","label": ["RETAIL"]}
{"text": "The TGL indoor golf simulator, co-founded by Tiger Woods and Rory McIlroy, has a gameplay format specifically designed for TV, taking cues from the NFL regarding pacing and incorporating commercial breaks. Traditional sports such as golf, motor sports, boxing and UFC dont have natural TV breaks, so TGL has built pauses into its format. This approach could define the future of sports media, with certain sports suiting particular TV platforms or streaming services.","label": ["SPORT"]}
{"text": "Small businesses and their owners could face thousands in fines for not complying with a new U.S. Treasury Department reporting requirement on time. Many havent filed yet, despite the requirements aim of curbing illicit finance.","label": []}
{"text": "Black entrepreneurs are tapping into Tulsas history, including the site of the once-thriving Black business district known as Black Wall Street, as inspiration and a resource as they seek to launch and grow their own companies.","label":[]}
{"text": "Fintech stocks were among the biggest losers as the Nasdaq suffered its worst drop since 2022. Bitcoin and stocks linked to crypto, as well as online lenders and payment companies, all fell more than the broader market.","label": ["FINANCE"]}
{"text": "The Chinese official said the U.S. did not show appreciation for what Beijing has done to curb fentanyl trade and instead raised duties on its goods twice this year.","label": ["TECH"]}
{"text": "Chipmaker Nvidias auto segment revenue more than doubled in the latest quarter to a record high on strong demand for driver-assist software, according to analysts.","label": ["TECH","SEMICONDUCTORS"]}
{"text": "The second annual CNBC Changemakers list of women transforming business and philanthropy includes leaders from biotech, AI, entertainment, food and finance. These women are pursuing purpose along with profits and tackling health-care needs, often their own.","label": []}
{"text": "The streaming giant will raise prices for its ad-free standard plan from $15.49 to $17.99 per month while its cheaper ad-supported plan will increase from $6.99 to $7.99. Its premium plan will see a monthly cost increase from $22.99 to $24.99.","label": ["ENTERTAINMENT"]}
{"text": "Disney, Fox and Warner Bros. Discovery have called off plans to launch their Venu sports streaming service. The decision followed an antitrust lawsuit filed by TV provider Fubo, which forced Disney to merge its Hulu+ Live TV with Fubo in a deal that gave Disney control of the resulting company.","label": ["ENTERTAINMENT"]}
{"text": "Comcast plans to launch Universal Ads, a new platform that will make it easier for smaller businesses to buy ad time and, in turn, beckon some advertisers away from social media and digital outlets and over to traditional TVs streaming businesses.","label": ["ENTERTAINMENT"]}
{"text": "Elon Musk and President Donald Trump have both recently criticized the U.S. Agency for International Development, with Trump going so far as to sign an executive order freezing foreign aid and reducing the agencys staff. The sudden criticism comes after a flurry of posts on Musks X social media platform, where he described USAID as a vipers nest of radical-left marxists who hate America, evil and a criminal organization.","label": []}
{"text": "The cable giant lost 139,000 residential broadband customers during the fourth quarter and will shift its focus to its mobile business in a bid for more customers.","label": ["ENTERTAINMENT"]}
{"text": "Disneys CFO says keeping TV networks business works best for now, despite losing subscribers. Comcast also exploring separating cable networks — but outcome is unclear. Traditional TV bundle still key to business, despite subscriber losses.","label": ["ENTERTAINMENT"]}
{"text": "Netflixs cheaper, ad-supported tier has reached 70 million global monthly active users two years after its launch. More than 50% of new sign-ups are for the plan, the company said.","label": ["ENTERTAINMENT"]}
{"text": "Sports and live events such as awards shows are the key to growth in the advertising market, according to media executives. Traditional TV is still important to advertisers, especially when it comes to sports.","label": ["ENTERTAINMENT"]}
{"text": "Comcast CEO Dave Watson said the company expects to lose more than 100,000 broadband subscribers during the fourth quarter as competition in the sector remains fierce.","label": ["ENTERTAINMENT"]}
{"text": "The company is designing the app now for a year-end launch and plans to offer its sports and news content, CEO Lachlan Murdoch says. Foxs streaming service wont upend its place in the traditional bundle, he says.","label": ["ENTERTAINMENT"]}
{"text": "Elon Musk says he will fix Twitters Community Notes feature, which he says is being gamed by governments and legacy media. The comments come after members of the public used the notes to refute claims that Ukrainian president Volodymyr Zelenskyy is unpopular.","label": []}
{"text": "Trump Media and fellow conservative-oriented social media company Rumble on Wednesday sued a Brazilian Supreme Court justice whose clash last year with Elon Musk led to the blocking of Musks own social media firm, X, in that country.","label": []}
{"text": "Warner Bros. Discovery said Thursday it added 6.4 million global streaming subscribers in the fourth quarter for a total of 116.9 million subscribers.","label": ["ENTERTAINMENT"]}
{"text": "Cable TV operator Altice USAs Optimum service lost the regional sports networks MSG Networks due to a carriage dispute. The disagreement led to New York Knicks, New York Rangers, New York Islanders, and New Jersey Devils fans losing access to games.","label": ["ENTERTAINMENT"]}
{"text": "Disneys streaming platforms are set to generate enough income to offset linear TV declines. The company predicts its streaming divisions will produce over $1bn in operating income for fiscal year 2025.","label": ["ENTERTAINMENT"]}
{"text": "The streaming business growth and profitability — combined with a blockbuster summer at the box office and further investments in the companys theme parks business — comes during a time of turmoil across the media industry.","label": ["ENTERTAINMENT"]}
{"text": "Jeff Bezos said Wednesday the Washington Posts opinion section will be dedicated to supporting personal liberties and free markets and will not publish views that oppose those ideas.","label": []}
{"text": "Neom, a Saudi Arabian hub for innovation, has partnered with Paradromics, a Texas-based neurotech startup that is developing a brain-computer interface. The partnership will establish a Brain-Computer Interface Centre of Excellence in the region to advance the development of BCI-based therapies, according to a company statement. Paradromics is developing an implantable system designed to help patients with paralysis regain communication abilities.","label": ["HEALTHCARE"]}
{"text": "Trump sued the social media company, then known as Twitter, for deplatforming his account following the Jan. 6, 2021, Capitol riot and the company has agreed to pay $10 million to settle the lawsuit.","label": []}
{"text": "Influencers including Katie Austin are being sent to the Super Bowl to create content for brands including Nike and Verizon. The NFL is attempting to attract younger audiences to the game using online creators, who can now command fees comparable to traditional celebrities.","label":["ENTERTAINMENT"]}
{"text": "Disneys board is counting on new chairman James Gorman to lead the selection of CEO Bob Igers replacement, and hopes hell do so sooner than the early-2026 deadline the company has announced.","label": ["ENTERTAINMENT"]}
{"text": "Food content creator Carla Lalli Music is quitting YouTube for Substack, saying she made more from the subscription platform in one year than from YouTube since 2021.","label": []}
{"text": "CNN CEO Mark Thompson announced the cuts in a company memo, confirming previous reports by CNBC. The news organization plans to invest $70 million in digital initiatives and hire 100 workers for new roles.","label": []}
{"text": "Disney and sports-focused streaming service Fubo are merging their respective live TV streaming services in a deal that will see Disney take a 70% controlling stake in the combined entity. The deal is expected to close within the next 12 to 18 months.","label": ["ENTERTAINMENT"]}
{"text": "Liberty Media announced it is spinning off most of its assets into a new publicly traded company, Liberty Live, apart from its auto racing properties, and that CEO Greg Maffei is stepping down.","label": []}
{"text": "The medical professional networks revenue rose 25% in Q3 from the year-ago period, and the company expects a strong Q4, too.","label": []}
{"text": "Snap shares rose as much as 11% in extended trading Tuesday after the company reported better-than-expected fourth-quarter earnings and revenue.","label": []}
{"text": "MSG Networks has reached a deal with Altice USA to bring back its New York-based NBA and NHL teams on its Optimum service.","label": []}
{"text": "Warner Bros. Discovery has agreed to end its quest to buy live NBA games in the US for the 2025-26 season and beyond, ending its legal disputes with the league and keeping the company in the mix with some NBA content.","label":["ENTERTAINMENT"]}
{"text": "Pinterest shares surged as much as 19% in Wednesdays trading session amid the company beating Wall Street estimates and robust user growth.","label": []}
{"text": "Shares dropped 5.3% after the company fell short of Wall Streets user growth estimates. But Reddit surpassed estimates for earnings and revenue.","label": []}
{"text": "Comcast investors didnt seem fazed by the companys plan to spin off cable networks, except Bravo, as a separate publicly traded entity. Uncertainty over the transactions impact and potential motives underscore the media industrys need to consolidate.","label": []}
{"text": "About 20% of Americans say they get their news from news influencers on social media, according to a Pew Research Center survey. The study found that 65% of Americans said information from news influencers helped them better understand the world, while 40% of adults under 30 said they get their news from independent social media figures.","label": ["ENTERTAINMENT"]}
{"text": "Regional sports network operator Diamond Sports has agreed a deal with Amazon Prime Video to make its 16 regional sports networks available on the streaming platform as an add-on subscription for Prime customers, according to a person familiar with the matter.","label": ["ENTERTAINMENT"]}
{"text": "The deal, which would have combined the two largest satellite TV providers in the U.S., is likely to be called off entirely after bondholders rebuffed a sweetened offer.","label": ["ENTERTAINMENT"]}
{"text": "The White House posted a video on Tuesday showing immigrants in shackles being prepared for a deportation flight in Seattle, and then retweeted the video with the comment, ASMR: Illegal Alien Deportation Flight.","label": []}
{"text": "Shares of Doximity, a digital platform for medical professionals, closed up 36% on Friday, a day after the company reported fiscal third-quarter results that beat Wall Streets expectations for revenue and guidance.","label": []}
{"text": "Warner Bros. Discovery has announced a restructuring plan that will see its business segmented into linear and streaming units, in a move that could simplify future consolidation.","label": ["ENTERTAINMENT"]}
{"text": "Elon Musk has said that a former staffer at his DOGE team who resigned after tweets advocating for racism and eugenics will be rehired. The announcement came a day after Vice President JD Vance said the former staffer, Marko Elez, should be rehired despite his views.","label": []}
{"text": "The FCC said it would investigate Comcast and NBCUniversal, in part over concerns that the companies promote diversity, equity and inclusion in a way that does not comply with FCC regulations.","label": []}
{"text": "ESPN is introducing a dedicated ESPN tile on Disney+ on Wednesday for those who subscribe to ESPN+, in a bid to boost subscribers. Those with ESPN+ subscriptions will have full access to all ESPN content through the tile on Disney+.","label": ["ENTERTAINMENT"]}
{"text": "The media giant said its Disney Advertising unit has defined a methodology for estimating ad-supported audience numbers. It includes 157 million global monthly active users watching ad-supported content across Disney+, Hulu and ESPN+.","label": ["ENTERTAINMENT"]}
{"text": "Comcast said it is moving forward with the spinoff of its cable network channels, including CNBC, MSNBC and E! The company had said it was considering a split of the cable networks.","label": ["ENTERTAINMENT"]}
{"text": "The companys broadband losses were disappointing and worse than what we indicated in early December, company president Mike Cavanagh said.","label": []}
{"text": "The media giant told employees it will comply with President Donald Trumps executive order banning the practice and demanding that agencies investigate private companies over their diversity, equity and inclusion programs.","label": []}
{"text": "Denver Broncos president Damani Leech praised the NFLs commitment to diversity despite corporate and governmental efforts to rollback diversity, equity, and inclusion hiring practices.","label": []}
{"text": "The former NFL quarterback indicated he is in talks to join a teams broadcast crew as an analyst. Brees, a certain Hall of Famer, has followed the path of other retired quarterbacks like Tom Brady and Tony Romo in commenting on plays and games from their unique perspective.","label": []}
{"text": "Some of the predictions made by media executives in 2023 about what would happen in the industry in 2024 turned out to be correct. But others missed the mark.","label": []}
{"text": "Toyota, Honda and others are investing in space startups to develop rockets and satellites that could be used for improving navigation services and autonomous vehicle technology.","label": ["TRANSPORT"]}
{"text": "Uber shares closed down more than 7% on Wednesday after the company reported Q4 revenue that beat expectations but missed on EPS and offered soft guidance.","label": ["TECH"]}
{"text": "Richard Parsons, who helped Time Warner divorce from AOL after what was considered one of the worst takeovers in history, has died at age 76. He became CEO of AOL Time Warner in 2002, replacing Gerald Levin.","label": []}
{"text": "President Donald Trumps nominee to lead the Centers for Disease Control and Prevention has been pulled, a Senate panel confirmed Thursday, just hours before the former lawmakers confirmation hearing.","label": ["HEALTHCARE"]}
{"text": "Walgreens said it reached a deal Thursday to go private, getting bought by New York-based private equity firm Sycamore Partners for roughly $10 billion.","label": ["HEALTHCARE"]}
{"text": "Digital physical therapy start-up Hinge Health is set to file for an IPO as soon as next week, with speculation it could go public as early as April, although timing could still change. The company, which generated $390m in revenue in 2024, has more than $1bn of investment from firms including Tiger Global and Coatue Management, giving it a $6.2bn valuation in 2021.","label": ["HEALTHCARE"]}
{"text": "AbbVie will pay up to $2.2 billion to develop Gubras experimental obesity drug, marking its late foray into the booming market for weight-loss treatments.","label": ["HEALTHCARE"]}
{"text": "Amazons palm-scanning technology will be rolled out at NYU Langone Health facilities to allow patients to check in for appointments. The health system, which deals with more than 10m visits annually, expects the system to cut sign-in times from two to three minutes to less than a minute. It will be available at facilities in New York from next week and rolled out further this year.","label":["HEALTHCARE"]}
{"text": "A measles outbreak in Texas has resulted in the death of an unvaccinated child, the first death from the disease in the U.S. in a decade.","label": ["HEALTHCARE"]}
{"text": "The Department of Veterans Affairs confirmed that all users of Oracles Federal EHR experienced a outage on Tuesday, impacting several VA facilities.","label": ["HEALTHCARE"]}
{"text": "Eli Lilly is now offering higher doses of its weight loss drug Zepbound in single-dose vials through its website, LillyDirect, for eligible patients to buy and have shipped to their homes.","label":["HEALTHCARE"]}
{"text": "The special committee of independent directors at 23andMe rejected CEO Anne Wojcickis proposal to take the genetic testing company private, according to a release.","label": ["HEALTHCARE"]}
{"text": "Healthcare software vendor Athenahealth will offer AI-powered documentation tool Abridge to its network of 160,000 clinicians, allowing doctors to record visits with patients in real-time to draft clinical notes. Abridges tool is the latest addition to Athenahealths solution, Ambient Notes, which offers various AI-powered documentation tools for doctors, with companies such as Suki and iScribeHealth already offering their products through the solution.","label": ["HEALTHCARE"]}
{"text": "The new top health official at the Department of Health and Human Services is a prominent vaccine skeptic and now wields enormous power over the federal agencies that regulate vaccines and set shot recommendations.","label": ["HEALTHCARE"]}
{"text": "Hims & Hers shares plunged as much as 18% in after-hours trading on Monday after the telehealth companys gross margin fell short of Wall Street expectations.","label": ["HEALTHCARE"]}
{"text": "Telehealth company Teladoc Health reported a wider-than-expected loss and disappointing quarterly guidance, causing its shares to fall in extended trading on Wednesday.","label": ["HEALTHCARE"]}
{"text": "Dragon Copilot has been designed to help doctors quickly pull information from medical sources and draft clinical notes, referral letters and more. It has been tested by 250 locations and nine hospitals throughout central Pennsylvania and northern Maryland. It will be available in the US and Canada from May, with roll outs to the UK, the Netherlands, France and Germany to follow.","label": ["HEALTHCARE"]}
{"text": "Novo Nordisk has launched a direct-to-consumer online pharmacy that will offer its weight loss drug Wegovy for less than half its usual price per month. Called NovoCare, the pharmacy will allow patients to pay $499 in cash per month for the weekly drug, which usually costs $1,350 per month.","label": ["HEALTHCARE"]}
{"text": "Trumps nominee to lead Medicare and Medicaid paid no Social Security or Medicare taxes in 2021 and negligible amounts in 2022, according to a memo from Democratic staff on the Senate Finance Committee.","label":["HEALTHCARE"]}
{"text": "Hims & Hers Health slumped 22% on Tuesday, a day after the telehealth company disappointed investors with its gross margin and the future of its weight-loss business.","label":["HEALTHCARE"]}
{"text": "Robert F. Kennedy Jr., the controversial new head of the Department of Health and Human Services, on Monday told food executives that he wants the worst ingredients out of food.","label": ["HEALTHCARE"]}
{"text": "One Medical CEO Trent Green is leaving the Amazon-owned health care company after less than two years in the role to become the head of National Research Corp.","label": ["HEALTHCARE"]}
{"text": "A new study, which is yet to be peer-reviewed, found that the active ingredient in Wegovy and Ozempic – semaglutide – is associated with hair loss compared to an older weight loss pill. Hair loss has been a known side effect of Novo Nordisks drugs, but the study highlights the risk of the ingredient itself.","label": ["HEALTHCARE"]}
{"text": "Baby boomers are now beginning to hit the long-term health space, but this niche is not prepared for the large number of boomers needing end of life care. Many businesses in this space are acquiring acquisitions from private equities and are for-profit.","label": ["HEALTHCARE"]}
{"text": "The FDA is responsible for regulating food and health-related products in the US, but its estimated that it only oversees 80% of the food supply. Companies are finding ways to introduce new food additives without the FDAs approval.","label": ["HEALTHCARE"]}
{"text": "The crucial March meeting of vaccine advisors to the Food and Drug Administration has been canceled which concerns flu strains for vaccines. The Department of Health and Human Services did not respond to comment.","label": ["HEALTHCARE"]}
{"text": "Vaccine skeptic RFK Jr. is making moves at HHS that could affect immunization uptake and policy, despite attempting to distance himself from those views during his Senate confirmation hearings.","label": ["HEALTHCARE"]}
{"text": "23andMe CEO Anne Wojcicki and investment firm New Mountain Capital have proposed a $2.53 per share takeover of the genetic testing company, according to a filing.","label": ["HEALTHCARE"]}
{"text": "Digital physical therapy provider Hinge Health has become the latest company to file for an IPO, in a sign that the market may be thawing after a three year drought. The company, which offers patients help treating musculoskeletal injuries and chronic pain, saw revenues climb 33% to $390m last year, with its net loss narrowing to $11.9m from $108.1m in 2021.","label": ["HEALTHCARE"]}
{"text": "Eli Lilly said it will invest at least $27 billion to build four new U.S. manufacturing sites as demand for its blockbuster weight loss and diabetes injections soars.","label": ["HEALTHCARE"]}
{"text": "Popular medical monitor Contec CMS8000 is the latest device produced in China to receive scrutiny for its potential cyber risks. The monitor tracks electrocardiograms, heart rate, blood oxygen saturation, non-invasive blood pressure, temperature and respiration rate. The FDA and Cybersecurity and Infrastructure Security Agency (CISA) have both warned about a backdoor in the device, an easy-to-exploit vulnerability that could allow a bad actor to alter its configuration. The American Hospital Association views the proliferation of Chinese medical devices as a serious threat to the system.","label": ["HEALTHCARE"]}
{"text": "Bluebird Bio Inc. said it will be acquired for about $30 million, marking the end of the companys fall from one of the buzziest biotech firms to one that was on the cusp of running out of money.","label": ["HEALTHCARE"]}
{"text": "Amgens experimental weight loss injection Maritide is undergoing two critical late-stage trials to enter the booming obesity drug market. A monthly injection, Maritide could compete against existing drugs from Novo Nordisk and Eli Lilly, which are weekly injectables. Around 6% of US adults are already using GLP-1s, a hormone produced in the gut to tamp down appetite and regulate blood sugar.","label": ["HEALTHCARE"]}
{"text": "As the population ages, Singapore is turning to artificial intelligence to help manage the health of its elderly population, with technology seen as a potential paradigm shift in healthcare, helping to fill the care gap. By 2030, a quarter of Singaporeans will be 65 or older, with technology able to assist caregivers and help seniors stay independent and age in place. However, developers have been urged to ensure that older people participate in the design of new technology to avoid replicating biases held by society, and ensuring the elderly are on board with any new initiatives.","label": ["HEALTHCARE"]}
{"text": "Freed has built an AI scribe for doctors that automates the clinical notetaking process in real time, helping doctors to spend more time with their patients and cutting down on administrative tasks. The company has just announced a $30m funding round led by Sequoia Capital.","label": ["HEALTHCARE"]}
{"text": "The TGL indoor golf simulator, co-founded by Tiger Woods and Rory McIlroy, has a gameplay format specifically designed for TV, taking cues from the NFL regarding pacing and incorporating commercial breaks. Traditional sports such as golf, motor sports, boxing and UFC dont have natural TV breaks, so TGL has built pauses into its format. This approach could define the future of sports media, with certain sports suiting particular TV platforms or streaming services.","label": ["SPORT"]}
{"text": "TV advertisers spent $244m on womens sports in 2024, a year-on-year increase of 139%, with basketball receiving the most investment of any sport, according to marketing firm EDO.","label": ["SPORT"]}
{"text": "ESPNs new service will be marketed as a tier of the more expensive platform, rather than its own standalone product, meaning there will be a flagship light, which will be the artist formerly known as ESPN+.","label": ["SPORT"]}
{"text": "The media rights agreement will see Comcast and the IOC collaborate on broadcast infrastructure, in-venue distribution, U.S. digital advertising, and more.","label": ["SPORT"]}
{"text": "Womens sports-focused investment firm Monarch Collective is expanding its fund from $150m to $250m after increased interest in the sector from investors. The firm, which has backers including ex-Netflix executive Cindy Holland and Pivotal Ventures, the venture capital firm of Melinda French Gates, will use the funding to invest in teams in the US and abroad.","label": ["SPORT"]}
{"text": "The GM-backed team, which will be called the Cadillac Formula 1 Team, got the green light to join the 2026 season as the 11th team on the grid.","label": ["SPORT"]}
{"text": "The sprinter, who won gold in the 200m and 400m at Atlanta 1996, talks about his career in sport, leadership and his new league for young athletes.","label": ["SPORT"]}
{"text": "Xiaomi President William Lu has announced at the Mobile World Congress in Barcelona that the company plans to sell its electric vehicles outside of China within the next few years. While there were no concrete timelines for Lus comments, Xiaomi launched its first premium EV, the SU7 Ultra, in China last week, with 15,000 orders made within 24 hours.","label": ["TRANSPORT"]}
{"text": "Delta Air Lines has joined other airlines in warning of a slowdown in travel, as it cuts its first-quarter revenue and profit forecasts citing weaker domestic demand and increased macro uncertainty.","label": ["TRANSPORT"]}
{"text": "Rivian reported its first gross quarterly profit of $170 million during the fourth quarter of 2024, but the electric vehicle maker expects lower sales and adjusted losses in 2025.","label": ["TRANSPORT"]}
{"text": "Shares of EV start-up Lucid Group were down more than 10% Wednesday after the company announced the abrupt departure of its CEO and a stock downgrade by Bank of America.","label": ["TRANSPORT"]}
{"text": "American Airlines plans to test free inflight Wi-Fi on some flights starting next week, as the pressure mounts on U.S. carriers to offer the service complimentary.","label": ["TRANSPORT"]}
{"text": "Companies that serve everyone from penny-pinching grocery shoppers to first-class travelers are seeing cracks in demand as the Trump administrations tariff policies and rising inflation take their toll on consumers.","label": ["TRANSPORT"]}
{"text": "The White House said it would exempt vehicles and parts that comply with the USMCAs rules of origin from the new 25% tariffs on Mexico and Canada that take effect next week.","label": ["TRANSPORT"]}
{"text": "Elon Musk has claimed that the FAAs air traffic control technology, provided by Verizon and L3Harris, is causing safety risks and is breaking down. The FAA is testing Starlink technology from Musks SpaceX as an alternative. Democrat lawmakers have raised concerns over conflicts of interest.","label": ["TRANSPORT"]}
{"text": "Lufthansa is hopeful that the new U.S. administration will support Boeing in overcoming issues that have led to industry-wide delivery delays, CEO Carsten Spohr said Thursday.","label": ["TRANSPORT"]}
{"text": "U.S. freight railroads are bracing for an impact that hits at the heart of a vast traffic network connecting world economies, as additional tariffs on China and the European Union are coming, on top of already announced tariffs on Mexico and Canada.","label": ["TRANSPORT"]}
{"text": "The airline is getting rid of its famous two bags fly free policy and will also introduce basic economy tickets that dont allow free changes or refunds.","label": ["TRANSPORT"]}
{"text": "Airlines have begun to cut their first-quarter profit and sales estimates as warnings of weaker economic backdrop are weighing on travel demand.","label": ["TRANSPORT"]}
{"text": "Roughly a third of vehicle production in North America could be cut by next week as a result of President Donald Trumps 25% tariffs on Mexico and Canada, according to S&P Global Mobility.","label": ["TRANSPORT"]}
{"text": "The airline is closing the satellite bases at Floridas Fort Lauderdale airport and at Texas Austin airport, affecting 280 flight attendants, a union says.","label": ["TRANSPORT"]}
{"text": "Annual negotiations between U.S. companies and the worlds maritime shipping giants are beginning, and this year, there are several key headwinds for the ocean carriers that could help companies claw back logistics costs.","label": ["TRANSPORT"]}
{"text": "Aircraft manufacturers say seats and other cabin features are among the latest delays in getting new planes to customers. Regulator approval for luxurious first- and business-class cabins with hundreds of parts are part of the holdup.","label": ["TRANSPORT"]}
{"text": "Porsches CEO says the company could lean on its partnership with Volkswagen, which has its own U.S. manufacturing base, as it braces for potential tariffs imposed by the White House.","label": ["TRANSPORT"]}
{"text": "The budget airline has exited bankruptcy, after a crippling few years, and is ready to take on competitors, its CEO says. One of those competitors is about to make a huge strategy shift, and Spirit could possibly win over customers, its CEO says.","label": ["TRANSPORT"]}
{"text": "Goodyear CEO Mark Stewart is seeking to lead a transformation plan for the quintessential American company, which has used blimps to tout its brand for a century.","label": ["TRANSPORT"]}
{"text": "Southwest Airlines has said it will start charging passengers to check bags for the first time, ending a half-century long policy that helped the carrier stand out from rivals.","label": ["TRANSPORT"]}
{"text": "Flights to several Florida airports were halted briefly by the FAA on Thursday night after a SpaceX Starship testing failure. The incident marks the second time this year that SpaceX experienced a mishap during a flight test of Starship.","label": ["TRANSPORT"]}
{"text": "In a worst-case scenario of a 25% increase in tariffs across the board, AerCap CEO Aengus Kelly said the price of a Boeing 787 plane could increase by $40 million.","label": ["TRANSPORT"]}
{"text": "The aviation industry is urging lawmakers to allocate more funding for hiring air traffic controllers and investing in new technology, as air travel demand has reached record highs and the industry suffers from staff shortages.","label": ["TRANSPORT"]}
{"text": "Tesla shares rose nearly 8% on Wednesday, building on a 3.8% gain from Tuesday and snapping a seven-day losing streak after its worst day since 2020 on Monday.","label": ["TRANSPORT"]}
{"text": "The Detroit automaker is raising its quarterly dividend by a quarter and will launch a new $6 billion share repurchase program.","label": ["TRANSPORT"]}
{"text": "The agency is calling on the FAA to prohibit helicopter flights in certain areas to avoid midair collisions with planes arriving at the airport.","label": ["TRANSPORT"]}
{"text": "Lucid Group said Tuesday that CEO Peter Rawlinson has stepped down and will be replaced by the companys chief operating officer Marc Winterhoff on an interim basis.","label": ["TRANSPORT"]}
{"text": "Shawn Fain, who has publicly denounced Trump in the past, says tariffs on auto companies will help stop job losses in America. The UAW president is in active negotiations with the Trump administration about plans to end what he calls the free trade disaster.","label": ["TRANSPORT"]}
{"text": "Airline stocks dropped to their lowest levels in almost a year on growing concerns about global economic growth and the potential for higher tariffs on goods from China and Mexico.","label": ["TRANSPORT"]}
{"text": "Chinese smartphone maker Oppo has partnered with Google to develop a private cloud computing system that will stop users sensitive conversations being accessed by its artificial intelligence. The deal will use Googles Confidential Computing software, which stops third parties accessing data through encryption, to create Oppos Private Computing Cloud. The aim is to stop users private information such as search history or private calls being used to train AI.","label": ["AI"]}
{"text": "Software engineers are using artificial intelligence to cheat in technical job interviews, using tools that provide them with real-time answers to coding problems, according to a CNBC report. The phenomenon has become so prevalent that Google CEO Sundar Pichai has suggested that the company consider bringing back in-person interviews.","label": ["AI"]}
{"text": "OpenAI has submitted its proposal to the US government, calling for the freedom to innovate and a partnership between the private and public sectors, while also highlighting the dangers of AI tech coming out of China.","label": ["AI"]}
{"text": "Apple has announced a $500m investment in the US over the next four years, including a new AI server factory in Texas and plans to hire 20,000 new employees. The move comes as Apple faces pressure from the Trump administration to manufacture its products in the US.","label": ["AI"]}
{"text": "Chinese start-up DeepSeek temporarily dethroned OpenAIs ChatGPT as the most downloaded free app on Apples App Store in January, shaking the AI market. Despite Nvidias stock falling more than 15% in a single day, companies are still developing AI-specific semiconductor chips and building out compute power for models to use. Experts predict more foundational models will appear, with increased competition keeping things in check.","label": ["AI"]}
{"text": "Alibaba has made its video-generation AI models open source, in a boost to the Chinese tech giants AI credentials and a further ramping up of competition with rivals like OpenAI. The four models, which will be available to academics and commercial institutions via Alibaba Clouds Model Scope and Hugging Face, are part of Alibabas Wan2.1 series, its foundational AI model.","label": ["AI"]}
{"text": "The Chinese smartphone maker, which spun off from Huawei in 2020, is looking to expand its market share. It will use the funds to develop AI agents and platforms, and prepare for the AGI era, according to a spokesperson.","label": ["AI"]}
{"text": "John Hope Bryant warns that AI will disproportionately impact those at the bottom of the pyramid. Urges governments to invest in upskilling the working and middle classes, and younger generations, in AI to boost economies. Jobs such as convenience and grocery store jobs are disappearing, he warns, and warns that those in lower education with limited relationship capital will be most at risk of redundancy within five years.","label": ["AI"]}
{"text": "Artificial intelligence company OpenAI has signed a deal with CoreWeave, a data centre technology provider, in a deal worth $11.9bn. As part of the deal, CoreWeave will receive a stake in OpenAI, valued at around $350m, which will be realised when CoreWeave lists publicly in the next few weeks.","label": ["AI"]}
{"text": "Singapore has been working to dismantle a network trafficking Nvidias AI chips to China, and last week authorities detained three people on charges of misrepresenting the final destination of US-manufactured servers that likely contained Nvidias chips.","label": ["AI"]}
{"text": "The tech giant has unveiled two new AI models which it said would help robots adapt to different situations, respond to instructions and manipulate objects. Google will partner with Texas-based robotics firm Apptronik to develop robots which can follow spoken commands.","label": ["AI"]}
{"text": "Public schools in the US, which educate around 50m students, face an uncertain future due to the Trump administrations plans to dismantle the Department of Education and reduce federal support for education. Some 13% of a schools overall funding comes from the federal government, and educators and learners are having to find ways to fill the gap, with many turning to AI tools such as OpenAIs ChatGPT. While some see the potential for AI to reduce teachers burdens, others are skeptical, pointing out that even the most advanced software needs human interaction to get the best results.","label": ["AI"]}
{"text": "Taiwan Semiconductor Manufacturing, a major chipmaker, will invest $100 billion more to bolster semiconductor manufacturing in the U.S., President Donald Trump announced Monday.","label": ["AI"]}
{"text": "The CEO of Pony.ai, James Peng, has said that Tesla is yet to show the results of large-scale testing of its autonomous vehicles, despite the companys size.","label": ["AI"]}
{"text": "Steve Wozniak has criticized the sledgehammer approach taken by Elon Musks Department of Government Efficiency to cut administrative costs and implement mass firings at federal government agencies.","label": ["AI"]}
{"text": "Scale AI has announced a deal with the Department of Defense for its flagship AI agent program, which it says will provide the military with AI-powered, data-driven warfare. The program will initially be rolled out to the U.S. Indo-Pacific Command and U.S. European Command, before being scaled up. The deal comes after several AI companies, including Google, Microsoft-backed OpenAI and Meta, have reversed bans on their technology being used for military purposes.","label": ["AI"]}
{"text": "Public policy chiefs at U.S. tech giants Google and Meta have said that Europes artificial intelligence industry is being held back by excessive regulation at a tech conference in Stockholm, Sweden, this week. Metas director of public policy, Chris Yiu, and Google DeepMinds head of public policy, Dorothy Chou, also said that the EUs AI Act was devised before ChatGPT had even come out, which was a key problem with Europes approach to regulating AI technology.","label": ["AI"]}
{"text": "Chinese artificial intelligence lab DeepSeek has created an AI model that it says is more efficient and cheaper than those made by US competitors. The development has led to a selloff in US tech and semiconductor stocks as investors worry about losing dominance. The innovation behind the DeepSeek model is a technique called distillation, which can allow a small team to create an advanced model quickly and efficiently. Now, startups and research labs can compete at the cutting edge faster than ever before, with Berkeley researchers recreating OpenAIs reasoning model for $450 in 19 hours, and a Stanford and University of Washington team doing the same for less than $50 in 26 minutes. Hugging Face, a startup, also recreated OpenAIs Deep Research as a 24-hour coding challenge.","label": ["AI"]}
{"text": "Europes luxury goods sector is showing signs of revival after an upbeat earnings season, but the sector could face challenges from U.S. tariffs and continued weakness in China.","label": ["RETAIL"]}
{"text": "LVMH shares sink as investors cautious following its annual results, despite them beating expectations. LVMHs critical fashion and leather goods and wines and spirits segments saw declining sales. The results come as a contrast after Cartier-owner Richemont reported highest ever sales over Christmas.","label": ["RETAIL"]}
{"text": "LVMH reported organic growth of 1% versus the previous year, beating expectations, driven by a strong performance in its selective retailing unit.","label": ["RETAIL"]}
{"text": "Shares of Burberry jumped as much as 16% on Friday after the company reported a shallower-than-expected dip in sales in the fiscal third quarter, providing a first glimpse of CEO Joshua Schulmans efforts to revamp the beleaguered British fashion house.","label": ["RETAIL"]}
{"text": "The French fashion house reported a better-than-expected jump in Q4 sales, with full-year sales up 14.7%, outperforming forecasts. The company cited the loyalty of customers as the reason for maintaining sales growth in an otherwise volatile macroeconomic environment.","label": ["RETAIL"]}
{"text": "Kering shares dropped more than 10% as it unveiled designer Demna Gvasalia as the new artistic director of its Gucci fashion line.","label": ["RETAIL"]}
{"text": "Richemont, owner of Cartier, jumped as much as 16% on the news, buoying hopes for Europes luxury sector. The company reported a 10% increase in fiscal third-quarter sales, which beat analyst expectations.","label": ["RETAIL"]}
{"text": "Family offices are taking on more risk than they realise with direct investments in private companies, according to a new survey. Nearly three-quarters of the executives surveyed by Campden Wealth said they felt the risk was manageable, but 46% said they had no formal procedures in place to accurately assess those risks.","label": ["RETAIL"]}
{"text": "The French luxury goods firm reported a 12% decline in Q4 revenues to 4.39bn euros ($4.52bn), slightly ahead of the 4.29bn euros forecast by LSEG analysts. Sales at Gucci, which account for almost half of the groups total revenues, plunged 24% annually.","label": ["RETAIL"]}
{"text": "Google Agrees to Buy Cloud Security Firm Wiz for $32 Billion", "label": ["TECH"]}
