{ "text": "Breaking: Apple unveils groundbreaking AR headset at its annual event", "label": "Opportunity" }
{ "text": "Exclusive: Google to invest $1.2B in next-gen AI research center", "label": "Opportunity" }
{ "text": "Urgent: Update your device software to avoid critical security risks now", "label": "Spam" }
{ "text": "Hot Deal: Claim your free tech gadget with no purchase required!", "label": "Spam" }
{ "text": "Innovation Update: Microsoft partners with Nvidia for advanced cloud gaming solutions", "label": "Opportunity" }
{ "text": "Breaking News: Amazon introduces a next-generation smart speaker with AI features", "label": "Opportunity" }
{ "text": "Alert: Verify your account immediately to unlock exclusive tech discounts!", "label": "Spam" }
{ "text": "Industry Update: Intel announces its next-gen processors set to redefine computing", "label": "Opportunity" }
{ "text": "Limited Time Offer: Get premium software upgrades absolutely free!", "label": "Spam" }
{ "text": "Tech Spotlight: Facebook rebrands as Meta and commits to major virtual reality investments", "label": "Opportunity" }
{ "text": "Hurry: Free trial of a cutting-edge app available now – act fast!", "label": "Spam" }
{ "text": "Update: IBM secures a major contract to implement quantum computing solutions for enterprises", "label": "Opportunity" }
{ "text": "Special Offer: Unlock free virus protection and boost your device's performance today", "label": "Spam" }
{ "text": "In-Depth: Samsung unveils a revolutionary foldable smartphone at the global tech expo", "label": "Opportunity" }
{ "text": "Exclusive: Dell announces a new lineup of high-performance laptops for remote work", "label": "Opportunity" }
{ "text": "Click Now: Win a free smartphone by entering our contest – limited spots available!", "label": "Spam" }
{ "text": "Breaking: Twitter introduces advanced safety features to protect user data", "label": "Opportunity" }
{ "text": "Limited Time: Enjoy free installation of premium tech software – register now", "label": "Spam" }
{ "text": "Tech News: Sony launches a state-of-the-art gaming console with enhanced graphics", "label": "Opportunity" }
{ "text": "Alert: Your device security is at risk! Update settings immediately", "label": "Spam" }
{ "text": "Update: HP expands its portfolio with innovative 2-in-1 convertible devices", "label": "Opportunity" }
{ "text": "Don't Miss: Unlock exclusive tech bonuses by updating your device info now", "label": "Spam" }
{ "text": "Industry News: Cisco wins a multi-million-dollar contract to upgrade urban network infrastructures", "label": "Opportunity" }
{ "text": "Hurry: Claim your free premium tech support package – offer ends soon", "label": "Spam" }
{ "text": "Latest: Oracle unveils new cloud solutions tailored for modern enterprises", "label": "Opportunity" }
{ "text": "Act Now: Earn free credits for top-tier tech tools – no catch, limited time", "label": "Spam" }
{ "text": "Innovation: Adobe releases a breakthrough creative suite powered by advanced AI features", "label": "Opportunity" }
{ "text": "Special Alert: Confirm your details now to get a free upgrade on your device performance", "label": "Spam" }
{ "text": "Breaking: Nvidia announces a revolutionary graphics card set to redefine gaming experiences", "label": "Opportunity" }
{ "text": "Limited Offer: Free download of an exclusive tech analysis report – click to claim", "label": "Spam" }
{ "text": "Update: Salesforce launches new CRM features powered by cutting-edge AI technology", "label": "Opportunity" }
{ "text": "Urgent: Secure your device now with our exclusive tech security patch – offer expires soon", "label": "Spam" }
