{"text": "One Medical CEO Trent Green is leaving the Amazon-owned health care provider after less than two years in the role to become the head of National Research Corp.",  "label": "Spam"}
{"text": "Freed has built an AI scribe that automates the clinical notetaking process in real time, and has just announced a $30m funding round led by Sequoia Capital. The tool is aimed at doctors at small, independent practices, who spend nearly nine hours a week on documentation, which is a significant contributor to burnout. Freeds tool has been adopted by 17,000 clinicians in 2 million patient visits a month.",  "label": "Spam"}
{"text": "Vaccine skeptic RFK Jr. is making moves that could affect immunization uptake and policy in the U.S., despite attempts to distance himself from such views during his Senate confirmation hearings.",  "label": "Opportunity"}
{"text": "Novo Nordisks diabetes drug Ozempic can also help people drink less alcohol, according to new research published in JAMA Psychiatry. It was a small study of just 48 adults that lasted over two months.",  "label": "Opportunity"}
{"text": "Dragon Copilot has been designed to help doctors quickly pull information from medical sources and draft clinical notes, referral letters and more.",  "label": "Opportunity"}
{"text": "The special committee of independent directors at 23andMe rejected CEO Anne Wojcickis proposal to take the genetic testing company private, according to a release.",  "label": "Spam"}
{"text": "The crucial March meeting of vaccine advisors to the Food and Drug Administration has been canceled which selects flu strains for shots released in the upcoming fall and winter. Dr. Paul Offit, a member of the advisory panel, received an email saying the upcoming March 13 meeting was canceled with no indication of whether it will be rescheduled.",  "label": "Spam"}
{"text": "Walgreens said it reached a deal with private equity firm Sycamore Partners that will take the drugstore chain private in a deal valued at between $10 billion and $23.7 billion, including debt.",  "label": "Spam"}
{"text": "23andMe CEO Anne Wojcicki and investment firm New Mountain Capital have proposed a $2.53 per share offer to take the genetic testing company private, according to a recent filing. The embattled firms special committee of independent directors will decide whether to approve the deal.",  "label": "Spam"}
{"text": "Bluebird Bio Inc. said it reached a deal to sell itself to private equity firms Carlyle and SK Capital for about $30 million, ending the companys more-than three decade history after it was on the cusp of running out of money.",  "label": "Spam"}
{"text": "AbbVie will pay up to $2.2 billion to develop Gubras experimental obesity drug, marking its late foray into the segment that includes blockbuster treatments.",  "label": "Opportunity"}
{"text": "Amgens experimental weight loss injection Maritide is undergoing two critical late-stage trials to enter the booming obesity drug market, with the trials main goal being to measure weight loss after 72 weeks. A phase two trial showed Maritide helped patients with obesity lose up to 20% of their weight on average after one year, with no weight loss plateau.",  "label": "Opportunity"}
{"text": "Telehealth company Teladoc Health reported a wider-than-expected loss and disappointing Q1 guidance, causing its shares to fall in extended trading. The company has seen its stock price drop each of the past four years due to competition, challenges at mental health division BetterHelp, and high operating costs.",  "label": "Spam"}
{"text": "Hims & Hers shares plunged as much as 18% in after-hours trading on Monday after the telehealth companys gross margin came in lower than expected.",  "label": "Spam"}
{"text": "The Department of Veterans Affairs confirmed that all users of Oracles Federal Electronic Health Record experienced a nation-wide outage on Tuesday, including those at VA medical centers.",  "label": "Spam"}
{"text": "Eli Lilly said it will invest at least $27 billion to build four new manufacturing sites in the U.S. as demand for its blockbuster weight loss and diabetes injections soars.",  "label": "Opportunity"}
{"text": "Patients at NYU Langone Health facilities will be able to check in for appointments using Amazons palm-scanning technology.",  "label": "Spam"}
{"text": "Baby boomers are now beginning to hit the long-term health space, but this niche is reportedly underfunded and understaffed with political uncertainty in the US. Private equity firms are increasingly looking to get in on the market, with 75% of US hospice agencies now for-profit.",  "label": "Opportunity"}
{"text": "The U.S. Food and Drug Administration said the shortage of active ingredient semaglutide, used in Novo Nordisks weight loss injection Wegovy and diabetes treatment Ozempic, is over.",  "label": "Spam"}
{"text": "Hims & Hers Health plummeted 22.0% on Tuesday after the telehealth companys Q4 earnings disappointed on gross margin. Hims & Hers is expected to stop offering a popular weight loss treatment on its platform.",  "label": "Spam"}
{"text": "The death of the child, who had not been vaccinated against measles, was confirmed by the Lubbock health departments director of public health. At least 124 people have been infected in West Texas.",  "label": "Spam"}
{"text": "Shares of UnitedHealth Group have tumbled more than 20% over the last three months due to a range of controversies, most recently a reported civil fraud investigation into its Medicare billing practices.",  "label": "Spam"}
{"text": "Novo Nordisk has launched a direct-to-consumer online pharmacy to offer its weight loss drug Wegovy for less than half its usual price per month and provide home deliveries. Called NovoCare, the pharmacy will allow patients to pay $499 in cash per month for the weekly drug and also offer patient support services.",  "label": "Spam"}
{"text":"Officials say actor Gene Hackmans wife, Betsy Arakawa, died of the disease last month in the couples New Mexico home. Hantavirus does not spread from person to person and is mainly transmitted through contact with rodents.",  "label": "Spam"}
{"text":"Marty Makary, Trumps pick to lead the FDA, told senators he plans to evaluate school lunches, the abortion pill and agency advisory committees. The surgeon and researcher at Johns Hopkins University has long called for change at the FDA.",  "label": "Spam"}
{"text":"There have been 198 reported cases in West Texas and 30 in a nearby county in New Mexico, with health officials saying the number is expected to rise.",  "label": "Spam"}
{"text":"After dissolving its maternal mortality review committee last year, Georgia has relaunched the panel. But it wont say whos on it — citing a confidentiality law, state officials say.",  "label": "Spam"}
{"text":"Two long-planned meetings — one at the CDC and another at the FDA — have now been disrupted under the watch of US Health and Human ",  "label": "Spam"}
{"text":"Services Secretary Robert F. Kennedy Jr., stirring questions about whether seasonal flu shots or other lifesaving vaccines will be delayed or harder to access.",  "label": "Spam"}
{"text":"The companys lunar lander, named Athena, arrived on the moon on Thursday but powered down a day later, amid concerns it wont be able to recharge. The landers position and the direction of the sun mean its unlikely to collect enough solar energy. The missions objectives will likely be achieved by the data already transmitted.",  "label": "Spam"}
{"text":"Muslims refrain from consuming any food or liquid from dawn until sundown during the holy month of Ramadan and experts offer tips to stay healthy.",  "label": "Spam"}
{"text":"The US Centers for Disease Control and Prevention will study vaccines and autism, despite evidence showing they dont cause the disorder, two sources said. The CDC will use the Vaccine Safety Datalink to study the issue.",  "label": "Opportunity"}
{"text":"President Trumps nominee for director of the National Institutes of Health, Dr. Jay Bhattacharya, answered senators questions about his views on vaccines, research funding and the role scientists should play in a pandemic.",  "label": "Spam"}
{"text":"US Health and Human Services Secretary Robert F. Kennedy Jr. is promoting an unconventional treatment for measles including a steroid, an antibiotic, and cod liver oil, which is rich in vitamin A. One of the doctors he is apparently taking cues from has been disciplined by the Texas Medical Board.",  "label": "Opportunity"}
{"text":"Insomnia can be a big problem as you get older. Exercise can help, especially those workouts that involve resistance to improve muscular strength, according to a new study.",  "label": "Spam"}
{"text":"The robotic lander made its final descent to the moons surface on Thursday, marking the second lunar touchdown for a US company this week.",  "label": "Spam"}
{"text":"It can be a tough love, but running is an inexpensive, easy way to fit in exercise nearly anywhere and anytime. Heres how one reluctant runner learned to love it.",  "label": "Spam"}
{"text":"People are rushed to the hospital emergency room for all sorts of unavoidable injuries, whether they got hit by a car or injured while playing sports.",  "label": "Spam"}
{"text":"Bacterial vaginosis, a common vaginal infection, should be classified and treated as a sexually transmitted disease, a new study says.","label": "Opportunity"}
{"text":"Covid-19 has changed the world. Heres how and we want to hear your thoughts.",  "label": "Spam"}
{"text":"Health officials in New Mexico are looking into the death of an unvaccinated person who recently tested positive for measles. New Mexico has reported 10 measles cases since the outbreak began, all in Lea County.",  "label": "Spam"}
{"text":"The US Health and Human Services secretary has suggested vitamin A as a treatment for measles, as an outbreak in West Texas grows. Doctors say that while vitamin A is important for vision and immunity, its not a substitute for vaccination.",  "label": "Opportunity"}
{"text":"When youre feeling down, one simple action can help you get going, according to experts and research — put on your sneakers.",  "label": "Spam"}
{"text":"Marty Makary, Trumps pick to lead the FDA, said in a Senate confirmation hearing he plans to evaluate school lunches, the abortion pill and agency advisory committees.",  "label": "Spam"}
{"text":"The Trump-era legislation was designed to protect Americans from surprise medical bills, however, the push to slash government spending is weakening the federal office implementing the No Surprises Act.",  "label": "Spam"}
{"text":"The tight-knit community of Mennonites in West Texas are the epicenter of a measles outbreak that has seen 159 cases across nine counties. One death has been reported, of an unvaccinated young girl who was a member of the Mennonite community.",  "label": "Spam"}
{"text":"Tea is a globally beloved beverage, and researchers say its brewing process may also help purify the water.",  "label": "Spam"}
{"text":"Measles outbreaks are causing alarm, but its not just the measles vaccine thats lagging. Use of other key childhood vaccines is down in more than 30 states, experts say. Heres what other illnesses could follow.",  "label": "Spam"}
{"text":"The SpaceX Starship spacecraft, the upper portion of the most powerful launch system ever built, exploded during its eighth test flight Thursday, disrupting air traffic and marking the second consecutive failure this year for the vehicle.",  "label": "Spam"}
{"text":"Its that time of year again in the US when we \"spring forward\" for Daylight Saving Time. Heres how it started and why its here to stay — for now.",  "label": "Spam"}
{"text":"The firings have gutted training programs that help address chronic understaffing in a public health system starved of resources.",  "label": "Spam"}
{"text":"Increasing physical activity may lower the risk of neuropsychiatric diseases, according to research presented Thursday in an abstract.",  "label": "Spam"} 
{"text":"The finding suggests that all intensities of exercise are beneficial, an expert says.",  "label": "Spam"}
{"text":"There has been a recent outbreak of measles in the United States, causing alarm among health experts due to the vaccination rate among children.",  "label": "Spam"}
{"text":"Light exercise such as walking or gentle stretching is acceptable when you have a mild illness above the neck, but strenuous exercise should be avoided. However, do not exercise if you have a fever or symptoms below the neck, such as chest congestion or an upset stomach, as this can slow recovery.",  "label": "Spam"}
{"text":"Researchers are looking into the mechanisms that make ultraprocessed foods unhealthy, and whether some ingredients interact with our bodies in ways that we dont yet understand.",  "label": "Opportunity"}


