{"text": "One Medical CEO Trent Green is leaving the Amazon-owned health care provider after less than two years in the role to become the head of National Research Corp.",  "label": "Negative"}
{"text": "Freed has built an AI scribe that automates the clinical notetaking process in real time, and has just announced a $30m funding round led by Sequoia Capital. The tool is aimed at doctors at small, independent practices, who spend nearly nine hours a week on documentation, which is a significant contributor to burnout. Freeds tool has been adopted by 17,000 clinicians in 2 million patient visits a month.",  "label": "Positive"}
{"text": "Vaccine skeptic RFK Jr. is making moves that could affect immunization uptake and policy in the U.S., despite attempts to distance himself from such views during his Senate confirmation hearings.",  "label": "Neutral"}
{"text": "Novo Nordisks diabetes drug Ozempic can also help people drink less alcohol, according to new research published in JAMA Psychiatry. It was a small study of just 48 adults that lasted over two months.",  "label": "Neutral"}
{"text": "Dragon Copilot has been designed to help doctors quickly pull information from medical sources and draft clinical notes, referral letters and more.",  "label": "Neutral"}
{"text": "Amazon AI scammers duped investors out of millions, FTC alleges",  "label": "Negative"}
{"text": "The special committee of independent directors at 23andMe rejected CEO Anne Wojcickis proposal to take the genetic testing company private, according to a release.",  "label": "Neutral"}
{"text": "The crucial March meeting of vaccine advisors to the Food and Drug Administration has been canceled which selects flu strains for shots released in the upcoming fall and winter. Dr. Paul Offit, a member of the advisory panel, received an email saying the upcoming March 13 meeting was canceled with no indication of whether it will be rescheduled.",  "label": "Neutral"}
{"text": "Walgreens said it reached a deal with private equity firm Sycamore Partners that will take the drugstore chain private in a deal valued at between $10 billion and $23.7 billion, including debt.",  "label": "Positive"}
{"text": "23andMe CEO Anne Wojcicki and investment firm New Mountain Capital have proposed a $2.53 per share offer to take the genetic testing company private, according to a recent filing. The embattled firms special committee of independent directors will decide whether to approve the deal.",  "label": "Positive"}
{"text": "Bluebird Bio Inc. said it reached a deal to sell itself to private equity firms Carlyle and SK Capital for about $30 million, ending the companys more-than three decade history after it was on the cusp of running out of money.",  "label": "Positive"}
{"text": "AbbVie will pay up to $2.2 billion to develop Gubras experimental obesity drug, marking its late foray into the segment that includes blockbuster treatments.",  "label": "Positive"}
{"text": "Amgens experimental weight loss injection Maritide is undergoing two critical late-stage trials to enter the booming obesity drug market, with the trials main goal being to measure weight loss after 72 weeks. A phase two trial showed Maritide helped patients with obesity lose up to 20% of their weight on average after one year, with no weight loss plateau.",  "label": "Neutral"}
{"text": "Telehealth company Teladoc Health reported a wider-than-expected loss and disappointing Q1 guidance, causing its shares to fall in extended trading. The company has seen its stock price drop each of the past four years due to competition, challenges at mental health division BetterHelp, and high operating costs.",  "label": "Negative"}
{"text": "Hims & Hers shares plunged as much as 18% in after-hours trading on Monday after the telehealth companys gross margin came in lower than expected.",  "label": "Negative"}
{"text": "The Department of Veterans Affairs confirmed that all users of Oracles Federal Electronic Health Record experienced a nation-wide outage on Tuesday, including those at VA medical centers.",  "label": "Negative"}
{"text": "Eli Lilly said it will invest at least $27 billion to build four new manufacturing sites in the U.S. as demand for its blockbuster weight loss and diabetes injections soars.",  "label": "Positive"}
{"text": "Patients at NYU Langone Health facilities will be able to check in for appointments using Amazons palm-scanning technology.",  "label": "Neutral"}
{"text": "Baby boomers are now beginning to hit the long-term health space, but this niche is reportedly underfunded and understaffed with political uncertainty in the US. Private equity firms are increasingly looking to get in on the market, with 75% of US hospice agencies now for-profit.",  "label": "Neutral"}
{"text": "The U.S. Food and Drug Administration said the shortage of active ingredient semaglutide, used in Novo Nordisks weight loss injection Wegovy and diabetes treatment Ozempic, is over.",  "label": "Positive"}
{"text": "Hims & Hers Health plummeted 22.0% on Tuesday after the telehealth companys Q4 earnings disappointed on gross margin. Hims & Hers is expected to stop offering a popular weight loss treatment on its platform.",  "label": "Negative"}
{"text": "The death of the child, who had not been vaccinated against measles, was confirmed by the Lubbock health departments director of public health. At least 124 people have been infected in West Texas.",  "label": "Neutral"}
{"text": "Shares of UnitedHealth Group have tumbled more than 20% over the last three months due to a range of controversies, most recently a reported civil fraud investigation into its Medicare billing practices.",  "label": "Negative"}
{"text": "Novo Nordisk has launched a direct-to-consumer online pharmacy to offer its weight loss drug Wegovy for less than half its usual price per month and provide home deliveries. Called NovoCare, the pharmacy will allow patients to pay $499 in cash per month for the weekly drug and also offer patient support services.",  "label": "Neutral"}
{"text":"Officials say actor Gene Hackmans wife, Betsy Arakawa, died of the disease last month in the couples New Mexico home. Hantavirus does not spread from person to person and is mainly transmitted through contact with rodents.",  "label": "Neutral"}
{"text":"Marty Makary, Trumps pick to lead the FDA, told senators he plans to evaluate school lunches, the abortion pill and agency advisory committees. The surgeon and researcher at Johns Hopkins University has long called for change at the FDA.",  "label": "Neutral"}
{"text":"There have been 198 reported cases in West Texas and 30 in a nearby county in New Mexico, with health officials saying the number is expected to rise.",  "label": "Neutral"}
{"text":"After dissolving its maternal mortality review committee last year, Georgia has relaunched the panel. But it wont say whos on it — citing a confidentiality law, state officials say.",  "label": "Neutral"}
{"text":"Two long-planned meetings — one at the CDC and another at the FDA — have now been disrupted under the watch of US Health and Human ",  "label": "Neutral"}
{"text":"Services Secretary Robert F. Kennedy Jr., stirring questions about whether seasonal flu shots or other lifesaving vaccines will be delayed or harder to access.",  "label": "Neutral"}
{"text":"The companys lunar lander, named Athena, arrived on the moon on Thursday but powered down a day later, amid concerns it wont be able to recharge. The landers position and the direction of the sun mean its unlikely to collect enough solar energy. The missions objectives will likely be achieved by the data already transmitted.",  "label": "Neutral"}
{"text":"Muslims refrain from consuming any food or liquid from dawn until sundown during the holy month of Ramadan and experts offer tips to stay healthy.",  "label": "Neutral"}
{"text":"The US Centers for Disease Control and Prevention will study vaccines and autism, despite evidence showing they dont cause the disorder, two sources said. The CDC will use the Vaccine Safety Datalink to study the issue.",  "label": "Neutral"}
{"text":"President Trumps nominee for director of the National Institutes of Health, Dr. Jay Bhattacharya, answered senators questions about his views on vaccines, research funding and the role scientists should play in a pandemic.",  "label": "Neutral"}
{"text":"US Health and Human Services Secretary Robert F. Kennedy Jr. is promoting an unconventional treatment for measles including a steroid, an antibiotic, and cod liver oil, which is rich in vitamin A. One of the doctors he is apparently taking cues from has been disciplined by the Texas Medical Board.",  "label": "Neutral"}
{"text":"Insomnia can be a big problem as you get older. Exercise can help, especially those workouts that involve resistance to improve muscular strength, according to a new study.",  "label": "Neutral"}
{"text":"The robotic lander made its final descent to the moons surface on Thursday, marking the second lunar touchdown for a US company this week.",  "label": "Neutral"}
{"text":"It can be a tough love, but running is an inexpensive, easy way to fit in exercise nearly anywhere and anytime. Heres how one reluctant runner learned to love it.",  "label": "Neutral"}
{"text":"People are rushed to the hospital emergency room for all sorts of unavoidable injuries, whether they got hit by a car or injured while playing sports.",  "label": "Neutral"}
{"text":"Bacterial vaginosis, a common vaginal infection, should be classified and treated as a sexually transmitted disease, a new study says.","label": "Neutral"}
{"text":"Covid-19 has changed the world. Heres how and we want to hear your thoughts.",  "label": "Neutral"}
{"text":"Health officials in New Mexico are looking into the death of an unvaccinated person who recently tested positive for measles. New Mexico has reported 10 measles cases since the outbreak began, all in Lea County.",  "label": "Neutral"}
{"text":"The US Health and Human Services secretary has suggested vitamin A as a treatment for measles, as an outbreak in West Texas grows. Doctors say that while vitamin A is important for vision and immunity, its not a substitute for vaccination.",  "label": "Neutral"}
{"text":"When youre feeling down, one simple action can help you get going, according to experts and research — put on your sneakers.",  "label": "Neutral"}
{"text":"Marty Makary, Trumps pick to lead the FDA, said in a Senate confirmation hearing he plans to evaluate school lunches, the abortion pill and agency advisory committees.",  "label": "Neutral"}
{"text":"The Trump-era legislation was designed to protect Americans from surprise medical bills, however, the push to slash government spending is weakening the federal office implementing the No Surprises Act.",  "label": "Neutral"}
{"text":"The tight-knit community of Mennonites in West Texas are the epicenter of a measles outbreak that has seen 159 cases across nine counties. One death has been reported, of an unvaccinated young girl who was a member of the Mennonite community.",  "label": "Neutral"}
{"text":"Tea is a globally beloved beverage, and researchers say its brewing process may also help purify the water.",  "label": "Neutral"}
{"text":"Measles outbreaks are causing alarm, but its not just the measles vaccine thats lagging. Use of other key childhood vaccines is down in more than 30 states, experts say. Heres what other illnesses could follow.",  "label": "Neutral"}
{"text":"The SpaceX Starship spacecraft, the upper portion of the most powerful launch system ever built, exploded during its eighth test flight Thursday, disrupting air traffic and marking the second consecutive failure this year for the vehicle.",  "label": "Neutral"}
{"text":"Its that time of year again in the US when we \"spring forward\" for Daylight Saving Time. Heres how it started and why its here to stay — for now.",  "label": "Neutral"}
{"text":"The firings have gutted training programs that help address chronic understaffing in a public health system starved of resources.",  "label": "Neutral"}
{"text":"Increasing physical activity may lower the risk of neuropsychiatric diseases, according to research presented Thursday in an abstract.",  "label": "Neutral"} 
{"text":"The finding suggests that all intensities of exercise are beneficial, an expert says.",  "label": "Neutral"}
{"text":"There has been a recent outbreak of measles in the United States, causing alarm among health experts due to the vaccination rate among children.",  "label": "Neutral"}
{"text":"Light exercise such as walking or gentle stretching is acceptable when you have a mild illness above the neck, but strenuous exercise should be avoided. However, do not exercise if you have a fever or symptoms below the neck, such as chest congestion or an upset stomach, as this can slow recovery.",  "label": "Neutral"}
{"text":"Researchers are looking into the mechanisms that make ultraprocessed foods unhealthy, and whether some ingredients interact with our bodies in ways that we dont yet understand.",  "label": "Neutral"}
{"text":"Bitcoin turned positive on Friday after the latest personal consumption expenditures price index came in line with expectations. The blue-chip coin was still down more than 11% for the week, however.",  "label": "Positive"}
{"text":"Nvidia on Wednesday reported fiscal fourth-quarter earnings that beat Wall Street expectations. The company also expects a significant ramp of sales of its next-generation AI chip, Blackwell, in Q1.",  "label": "Positive"}
{"text":"Stripe announced a tender offer for employee shares at a $91.5 billion valuation, making the payments company more valuable than publicly traded peers. Remaining private allows Stripe to skirt the stock swings that its publicly traded peers have faced in recent months. Fintechs can be more sensitive to economic conditions than the broader tech sector because theyre more directly effected by interest rates, employment data and consumer confidence.",  "label": "Positive"}
{"text": "SoftBank is in talks to invest $40bn in OpenAI, giving the artificial intelligence (AI) startup a $260bn pre-money valuation and a $300bn post-money valuation, according to reports. OpenAI was last valued at $157bn in October. The deal is expected to close over the next 12 to 24 months.",  "label": "Positive"}
{"text": "Megacap tech firms Meta, Alphabet, Amazon and Microsoft are set to spend $320bn on AI technologies and datacentres in 2025, up from $230bn in capex last year, despite recent market selloffs. Amazon plans to spend over $100bn, while Microsoft and Alphabet are targeting $80bn and $75bn respectively. CEO Mark Zuckerberg set Meta's AI budget at between $60bn and $65bn last month, calling 2025 the defining year for AI.",  "label": "Positive" }
{"text": "Apple has announced plans to open a new factory for artificial intelligence servers in Texas as part of a $500bn investment in the US. The tech giant will also create 20,000 new jobs in the US, most of which will focus on research and development, silicon engineering and AI and machine learning. The move comes as Apple faces pressure from the Trump administration to manufacture its products in the US.",  "label": "Positive" }
{"text":"Obvious Ventures, co-founded by Twitters Evan Williams, has filed to raise $400m for its latest fund, according to a regulatory filing. The firms most recent fund was raised in 2022, when it secured $355m, short of its $400m target. Obvious Ventures is known for its early investment in alternative meat company Beyond Meat. Since its IPO in 2019, Beyond Meats market cap has fallen below $300m.",  "label": "Positive"}
{"text": "DuPont shares jumped on better-than-expected earnings and revenue, boosted in part by the company's exposure to the fast-growing AI semiconductor market.",  "label": "Positive" }
{"text":"Xiaomi President William Lu has announced at the Mobile World Congress in Barcelona that the company plans to sell its electric vehicles outside of China within the next few years. While no specific timeline was given, Lus comments underscore the companys ambitions to take on Tesla in the global EV market. Xiaomi launched its first premium EV, the SU7 Ultra, in China last week, with orders reaching 15,000 within 24 hours.",  "label": "Positive"}
{"text":"Snowflake shares rose 4.5% Thursday after the data analytics software company posted stronger-than-expected fourth-quarter results.",  "label": "Positive"}
{"text":"Stripe announced a tender offer for employee shares at a $91.5 billion valuation, making the payments company more valuable than its public market peers. Remaining private allows Stripe to skirt the stock swings that its publicly traded competitors have experienced and disclose fewer numbers regarding its financial health.",  "label": "Positive"}
{"text":"Bitcoin will hit $200,000 this year and $500,000 during Donald Trumps presidency, says Geoffrey Kendrick, head of digital assets research at Standard Chartered. He said the industry needs traditional financial players and more regulatory clarity to add to bitcoins upside potential.",  "label": "Positive"}
{"text":"The company expects to sell $15 billion in AI system sales in the current year, it said Thursday on an earnings call.",  "label": "Positive"}
{"text":"Stripe revealed it generated $1.4 trillion in total payment volume in 2024, up 38% from the year prior. The company also announced a new tender offer for employees and shareholders that values the payments startup at $91.5 billion.",  "label": "Positive"}
{"text":"Nvidia shares jumped more than 4% on Friday, pushing the companys market cap back above $3 trillion, after it reported better-than-expected earnings this week.",  "label": "Positive"}
{"text":"Shares of AppLovin closed down more than 12% Wednesday after two short seller reports alleged the companys AI-powered ad platform used fraudulent advertising tactics to steal data.",  "label": "Positive"}
{"text":"The company expects to sell $15 billion in AI system sales in the current year, it said on Thursday.",  "label": "Positive"}
{"text":"Nvidia shares rebounded 3.9% Friday, pushing the chipmakers market cap back above $3 trillion, after it sunk Thursday following the companys quarterly earnings report.",  "label": "Positive"}
{"text": "A bipartisan bill is being introduced to ban China's DeepSeek artificial intelligence software from U.S. government devices on national security concerns.",  "label": "Negative" }
{"text": "Meta and Google have said that Europe's AI industry is being held back by excessive regulation, adding to rhetoric from Donald Trump's administration that the region's strict tech rules are choking innovation.",  "label": "Negative"} ,
{"text":"The subpoenas were sent to Alphabet, Meta, Amazon, Apple, Microsoft, TikTok, X and video platform Rumble. The committee wants to understand how foreign governments have limited Americans access to lawful speech.",  "label": "Negative" }
{"text":"Telehealth company Teladoc Health reported a wider-than-expected loss and disappointing quarterly guidance on Wednesday. The stock fell more than 5% in extended trading.",  "label": "Negative"}
{"text":"Bitcoin turned positive on Friday after the latest personal consumption expenditures price index came in line with expectations. The blue-chip coin was still down more than 11% for the week, however.",  "label": "Negative"}
{"text":"The stock fell 12% in its biggest one-day decline ever as the grocery delivery company posted a Q4 revenue miss and light guidance for the current quarter.",  "label": "Negative"}
{"text":"The software giant reported weaker-than-expected quarterly revenue and issued a forecast that fell short of Street estimates.",  "label": "Negative"}
{"text":"The grocery delivery companys stock dropped 12% on Wednesday, its worst day on record, following a Q4 revenue miss and light guidance for the current period.",  "label": "Negative"}
{"text":"The stock dropped as the telehealth company reported a wider-than-expected loss and issued disappointing quarterly guidance.",  "label": "Negative"}
{"text": "OpenAI is considering building data centre campuses in 16 US states that have indicated real interest in its projects linked to President Donald Trump's Stargate plans. The company is looking to build five to 10 data centre campuses in total and each campus is expected to generate thousands of jobs. However, reports have suggested that the first data centre in Abilene, Texas, would only create 57 jobs.",  "label": "Neutral"}
{"text":"The company intends to debut a Meta AI standalone app during the second quarter, according to people familiar with the matter.",  "label": "Neutral"}
{"text": "The geopolitics of AI takes center stage at the Paris AI Action Summit as world leaders, business executives, and experts will look to make pledges on guiding AI development.",  "label": "Neutral" }
{"text": "French President Emmanuel Macron has declared that France is back in the AI race and leading a European charge to innovate and develop AI alongside the US and China, despite concerns about burdensome regulation hampering innovation.",  "label": "Neutral" }
{"text": "China's DeepSeek generative AI app and its success has thrown into question whether U.S. export controls can truly slow the development of AI in China and whether the U.S. should even try.",  "label": "Neutral" }
{"text":"The Securities and Exchange Commission issued new guidance on Thursday saying it does not deem most meme coins securities under U.S. federal law. The move comes after the latest rapid rise of such cryptocurrencies following the election of President Donald Trump.",  "label": "Neutral"}
{"text":"The Chinese technology company continues its push into premium devices as it seeks to challenge Samsung. Xiaomi launched its new smartphones at the Mobile World Congress in Barcelona as it looks to continue its recent rise.",  "label": "Neutral"}
{"text":"Xiaomi unveiled its Xiaomi 15 and Xiaomi 15 Ultra smartphones at the Mobile World Congress in Barcelona. The launch continues Xiaomis push into premium devices as it challenges Samsungs market leadership.",  "label": "Neutral"}
{"text": "Chinese start-up DeepSeek temporarily dethroned OpenAI's ChatGPT as the most downloaded free app on Apple's App Store in January, but behind the scenes, AI enablers such as Nvidia felt the heat of a shaken market.",  "label": "Neutral" }
{"text": "Chinese artificial intelligence lab DeepSeek has created cheaper, more efficient AI models than those made in the US, sparking a selloff and wider reaction in Silicon Valley. The AI development technique of distillation, which allows smaller teams to create advanced models, is now prompting larger tech companies to re-evaluate their strategies. OpenAI's CEO Sam Altman said the company would adopt a more open-source strategy in light of DeepSeek's success.",  "label": "Neutral" }
{"text": "Google DeepMind CEO Demis Hassabis has said Chinese start-up DeepSeek's AI model is probably the best work to come out of China, although he said it did not demonstrate any new scientific advances. The company's claims that its model was trained at a fraction of the cost of leading AI firms have sparked debate over tech firms' spending on AI infrastructure. Hassabis said Google's own Gemini 2.0 Flash models were more efficient than DeepSeek's offering.",  "label": "Neutral" }
{"text":"The embatextd chipmaker said Friday it wont complete construction on the first plant until 2030, pushing back the target for starting operations.",  "label": "Neutral"}
{"text":"The retailer is looking to expand its discount offering, Haul, which directly competes with Chinese rivals Shein and Temu, to Europe later this year, according to two unnamed sources. The expansion comes after the company launched Haul in the US in November, and follows recent job postings for roles linked to the service.",  "label": "Neutral"}
{"text":"Jack Dorseys Block has created a fix for what it calls a multi-billion dollar problem waiting to happen: what happens to your Bitcoin when you die? The company is rolling out a feature that lets users set a beneficiary for their bitcoin holdings, creating a simple system for transferring the digital currency in the case of death.",  "label": "Neutral"}
{"text": "Two prominent AI scientists have expressed fears about artificial general intelligence (AGI), the development of which is currently being discussed by some of the world's biggest companies. The scientists fear that AGI, smarter than humans, could pose a threat to its creators as it develops a mind of its own, in effect creating a new species that humans are unable to control. The solution, they believe, lies in tool AI, a system with a specific, narrowly-defined purpose that does not require agency.",  "label": "Neutral" }
{"text": "Alibaba has made its video-generation AI models free to use, in a move that ramps up competition with the likes of OpenAI. The Chinese firm has made four models, which form part of its Wan2.1 foundational AI series, open source on Alibaba Cloud's Model Scope and Hugging Face. The models can generate images and video from text and image inputs.",  "label": "Neutral" }
{"text":"The company revealed its latest smart glasses, Aria Gen 2, which are aimed at bolstering AI, robotics and machine perception research. Envision, a startup working on services for the visually impaired, will use the device.",  "label": "Neutral"}
{"text":"Jack Dorseys Block, formerly known as Square, has created a fix for what it calls a multi-billion dollar problem waiting to happen for holders of bitcoin, and is now bringing it to market. The problem is what happens to a persons cryptocurrency when they die, which is a thorny issue for anyone who holds bitcoin, due to its self-custodial nature.",  "label": "Neutral"}
{"text":"Apples new iPhone 16e ships without fingerprint scanning technology, dubbed Touch ID, as a biometric security feature. Instead, the new budget phone offers facial recognition technology, or Face ID. But experts say fingerprint scanning tech still has a future, and Apple is likely to bring back Touch ID when it perfects under-the-screen technology.",  "label": "Neutral"}
{"text":"Amazon revealed its first chip designed for quantum computing, called Ocelot, and said the design is a step toward building efficient high-scale systems.",  "label": "Neutral"}
{"text":"The company revealed its latest experimental smart glasses, Aria Gen 2, which are designed to help bolster research into artificial intelligence, robotics and machine perception.",  "label": "Neutral"}
{"text": "Big Tech's historic gains could be affecting your portfolio's makeup, especially if the goal is diversification, according to the CEO of Astoria Portfolio Advisors. One ETF aimed at diversification is up more than 26% since its July launch.",  "label": "Neutral" }
{"text": "Leveraged and inverse ETFs that allow investors to make big bets on market direction are gaining in popularity, Direxion CEO says. Market volatility and frequent market-moving headlines are fueling demand for these products, he says.",  "label": "Neutral" }
{"text": "The set it and forget it investment strategy is no longer viable, according to Lisa Shalett, chief investment officer at Morgan Stanley Wealth Management, who said rising uncertainty and changing conditions have made diversification more important than ever.",  "label": "Neutral" }
{"text":"The payment processing firm revealed its annual letter and announced a tender offer that values the company at $91.5bn, close to its peak valuation of $95bn in 2021. The company, which revealed a profitable year in 2024 with $1.4tn in payment volume, also spoke of its no-imminent IPO plans and its focus on AI clients.",  "label": "Neutral"}
{"text":"Amazon is looking to expand its discount shopping service, Haul, which aims to undercut competitors Shein and Temu, two people with knowledge of the matter say. The company intends to launch the storefront in Europe later this year and is recruiting engineers to help with the project. Haul was launched in the US in November, and offers a range of products for $20 or less.",  "label": "Neutral"}
{"text":"Meta has apologised after an error led to some Instagram users seeing a surge in violent, graphic content on their Reels page, despite the highest level of sensitive content setting being enabled. The company blamed the issue on an error, saying it had now been fixed, and said its policies do not allow graphic content unless it is used to raise awareness of important issues. The issue comes after Meta announced plans to update its moderation policies to promote free expression.",  "label": "Neutral"}
{"text":"The software maker said it would lay off about 9% of its workers following a series of headcount reductions across the tech industry.",  "label": "Neutral"}
{"text":"The company intends to debut a Meta AI standalone app during Q2, according to inside sources, marking a major step in CEO Mark Zuckerbergs plan to make his company the leader in AI by the end of the year.",  "label": "Neutral"}
{"text":"The e-commerce giant on Wednesday announced a long-awaited overhaul of its Alexa digital assistant and will charge a monthly subscription fee to access it.",  "label": "Neutral"}
{"text":"SpaceX has been given the go-ahead to launch its Starship rocket, despite the FAA previously fining the company for safety and procedural violations and the rocket exploding during a test flight in January. The company has yet to complete its mishap investigation.",  "label": "Neutral"}
{"text":"Apples new iPhone 16e ships without fingerprint technology, but experts say the company is likely to bring back fingerprint scanning once it has perfected under-the-screen technology.",  "label": "Neutral"}
{"text":"Blue Origin announced its next crewed mission, which will include singer Katy Perry and TV host Gayle King along with Lauren Sanchez, Jeff Bezos fiancée. The companys New Shepard rocket will launch into space this coming spring.",  "label": "Neutral"}
{"text":"Metas decision to end third-party fact-checking on its platforms was a pragmatic one, according to Alexis Ohanian, the co-founder of social news aggregation website Reddit. Ohanian said the move was a reversal of an unviable program, adding that it was impossible to do fact-checking at scale.",  "label": "Neutral"}
{"text":"Obvious Ventures, the venture capital firm co-founded by Twitters Evan Williams, has filed to raise $400m for its latest fund, according to a regulatory filing. The firm raised its most recent fund in 2022, when it brought in about $355m.",  "label": "Neutral"}
{"text":"Microsoft confirmed Saturday evening that service was restored following an outage that left tens of thousands of users unable to access their Outlook email accounts and other programs.",  "label": "Neutral"}
{"text":"Chipmaker Nvidia named Huawei as a competitor in an annual filing, despite U.S. restrictions on the Chinese tech firm.",  "label": "Neutral"}
{"text":"The Securities and Exchange Commission issued new guidance saying it does not deem most meme coins securities under U.S. federal law. The agencys Division of Corporation Finance said the coins – which include Dogecoin – are akin to collectibles.",  "label": "Neutral"}
{"text":"Nvidia named Huawei as one of its top competitors in its annual filings, despite U.S. restrictions on the Chinese tech firm.",  "label": "Neutral"}
{"text":"The software maker is laying off about 9% of its workers after Meta and Google announced big job cuts this year.",  "label": "Neutral"}
{"text":"Reddit co-founder Alexis Ohanian has said Metas decision to end third-party fact-checking on its platforms was a pragmatic move, adding it was impossible to do fact-checking at scale. Meta announced the end of the programme, criticised by Trump and conservatives for what they said was the targeting of right-wing content, in January, with CEO Mark Zuckerberg announcing a community-based system as a replacement.",  "label": "Neutral"}
{"text":"Meta has apologised after an error led to some Instagram users seeing a flood of violent and graphic content on their Reels page, despite the highest level of sensitive content control being enabled. The company removed the content and said it was working on improving its moderation policies.",  "label": "Neutral"}
{"text":"Alphabet unit Google has told staffers in its People Operations and cloud organisations that it plans to cut employees as part of internal reorganisations, according to a memo viewed by CNBC. The company confirmed the changes, saying they are part of the normal course of business.",  "label": "Neutral"}
{"text":"Microsoft investigated an issue that prevented users from accessing Outlook and other services like Teams, Exchange, Azure, and M365, but services were restored according to the company.",  "label": "Neutral"}
{"text":"The 21-year-old service is shutting down May 5, and Microsoft is nudging users to migrate to its free Teams app.",  "label": "Neutral"}
{"text":"The artificial intelligence-powered AXON advertising software helped drive the tech giant to become the top-performing tech stock of 2024, but two new reports cast doubt on the integrity of the product.",  "label": "Neutral"}
{"text":"Blue Origin announced its next crewed mission, which will include singer Katy Perry and media personality Gayle King along with four other women. The company has recently announced redundancies amid plans to speed up rocket launches.",  "label": "Neutral"}
{"text":"Amazon on Wednesday announced a long-awaited overhaul of its Alexa digital assistant and will charge a monthly subscription fee to access it. The revamped service, which Amazon is calling Alexa+, is powered by generative artificial intelligence and will cost $19.99 a month, or free for Amazon Prime members.",  "label": "Neutral"}
{"text":"Google plans to cut employees in its People Operations and cloud organisations, according to an internal memo issued by HR chief Fiona Cicconi. The company will offer a voluntary exit programme to staff in its human resources division, while some cloud unit operations support staff will see their roles moved to other countries.",  "label": "Neutral"}
{"text":"Microsoft said Friday that the 21-year-old calling and messaging service will shut down May 5. The software company is encouraging users to migrate to its free Teams app.",  "label": "Neutral"}


