{"text":"Nikola Jokić recorded the first ever triple-double of at least 30 points, 20 rebounds and 20 assists in NBA history. The Denver Nuggets star has put himself further in the running for a fourth consecutive MVP crown with his latest achievement.","label":"Spam"}
{"text":"Tennis player Novak Djokovic will be backed by his coaching ally Andy Murray as he aims to win the Indian Wells title for the first time in a decade.","label":"Spam"}
{"text":"Italian teenager Andrea Kimi Antonelli will replace seven-time F1 champion Lewis Hamilton at Mercedes next season, the team has confirmed. Antonelli, 18, will partner fellow-teenager George Russell at the Silver Arrows. The teams statement quoted Antonelli as saying, \"I am still learning a lot, but I feel ready for the Spam.","label":"Spam"}
{"text":"Nikola Jokić recorded the first ever 30-20-20 triple-double in NBA history as the Denver Nuggets defeated the Phoenix Suns 149-141 in overtime.","label":"Spam"}
{"text":"The NHL put on a show in the first edition of the midseason international tournament. In the final, Canadas mens hockey team defeated Team USA 3-2 in overtime.","label":"Spam"}
{"text":"Jon Cooper, the Canadian coach of the NHLs 4 Nations Face-Off tournament, says politics threatened to distract from the sporting action — until it became an inspiring showcase for national pride.","label":"Spam"}
{"text":"The match, against CA Osasuna had been scheduled for Saturday in Barcelona but was postponed following the death of the team doctor. No cause of death was provided by the club.","label":"Spam"}
{"text":"Alabama and St. Johns took wins in their final regular season games in dramatic style, sealing victory with overtime buzzer-beaters.","label":"Spam"}
{"text":"The fund will provide WTA players with financial support, as well as resources to help them start or expand their families, including paid maternity and parental support, grants for egg and embryo freezing and IVF treatment.","label":"Spam"}
{"text":"Dallas Mavericks star Kyrie Irving has suffered a torn ACL in his left knee, an injury that is likely to see him miss the rest of the NBA season, the team announced Tuesday.","label":"Spam"}
{"text":"Fenerbahce manager Jose Mourinho has been accused of making racist statements by Turkish football club Galatasaray, who now plans to pursue criminal charges against the iconic coach.","label":"Spam"}
{"text":"João Fonseca is fast becoming one of the most exciting talents in mens tennis. The 18-year-old Brazilian impressed in windy conditions against Britains Jacob Fearnley at the BNP Paribas Open at Indian Wells.","label":"Spam"}
{"text":"F1 Experiences offers a range of packages at all 24 races in the season that span 21 countries. The offerings include everything from tickets to the race itself, to behind-the-scenes access and luxurious hospitality suites.","label":"Spam"}
{"text":"Paulo Fonseca, the head coach of French soccer team Olympique Lyonnais, has been given a nine-month suspension after confronting a referee.","label":"Spam"}
{"text":"Boston Common Golf and Jupiter Links GC have been eliminated from the TGL playoffs despite the best efforts of founders Rory McIlroy and Tiger Woods. Both clubs needed to win on Monday to qualify for the postseason but were unsuccessful, failing to find the necessary form.","label":"Spam"}
{"text":"The Premier League giant announced the additional job cuts on Monday as the club looks to halt a run of five straight years of financial losses.","label":"Spam"}
{"text":"Novak Djokovics surprise defeat to Botic van de Zandschulp marked his third consecutive defeat, the first time since 2018 the Serbian has suffered such a losing streak.","label":"Spam"}
{"text":"The car containing the trophies was stolen after Tennis Hall of Famer Pam Shriver left them in it while staying in a hotel because of wildfires. Shriver said on Tuesday that the trophies are in the possession of local police.","label":"Spam"}
{"text":"Australian golfer Steven Alderson made history by winning the Estrella Damm NA Andalucía Masters in Spain earlier this month. He spoke emotionally about being bullied and the triumph triggered a global outpouring of support.","label":"Spam"}
{"text":"The seven-time world champion dismissed comments from the sports former CEO and a former F1 team chief. He said in an interview that he never replies to older white men who comment on his career.","label":"Spam"}
{"text":"Aston Martin has signed up legendary Formula One designer Adrian Newey, who is regarded as the sports greatest ever engineer. Newey, 65, has agreed a long-term deal with the British team and will join in March 2025, after 20 years with Red Bull. The deal is a statement of intent from Aston Martin executive chairman and part-owner Lawrence Stroll, who believes Newey can bring the team championship success.","label":"Spam"}
{"text":"The Philadelphia Eagles are upset that the Green Bay Packers have submitted a proposal to ban a play known as the \"tush push \" or \"brotherly shove \" which is a key part of the Eagles playbook.","label":"Spam"}
{"text":"Brazilian teenager Joao Fonseca is fast becoming one of the most exciting talents in mens tennis, after securing his second victory at an ATP Masters 1000 tournament against Britains Jacob Fearnley.","label":"Spam"}
{"text":"After coming out in a social media post, João Lucas Reis da Silva says he was uplifted by the supportive reaction of others, and it gave him strength on the court.","label":"Spam"}
{"text":"Australian golfer Jeffrey Guan was blinded in one eye after being struck by a golf ball during a tournament. The 20-year-old was making his PGA Tour debut after competing in the Procore Championship last month.","label":"Spam"}
{"text":"Annie Palmer, the \"White Witch\" of Rose Hall in Jamaica, is a cornerstone of local folklore and tourism. But some are starting to question whether she ever existed at all.","label":"Spam"}
{"text":"Golfing trips to his favorite courses in Scotland helped architect Jim Hartsell come to terms with the death of his son. His book, \"When Revelation Comes, \" details the trips and his sons death at 21 from an accidental drug overdose.","label":"Spam"}
{"text":"Rising star Andrea Kimi Antonelli has passed his driving test in time for his Formula One debut. The 18-year-old will drive for Mercedes in Australia on March 24.","label":"Spam"}
{"text":"Headlines were made pre-season with the shock departure of Hamilton from Mercedes and the potential for a thrilling title battle between Verstappen and Norris. The season did not disappoint.","label":"Spam"}
{"text":"The Washington Nationals will continue to have their games televised by the Mid-Atlantic Sports Network, with an option to explore alternatives after the 2025 season, MLB announced Monday.","label":"Spam"}
{"text":"The Philadelphia Eagles are expected to accept an invitation to visit the White House after winning the Super Bowl, a source with the team told CNN. The visit has not yet been extended.","label":"Spam"}
{"text":"Trump said on Truth Social he will issue a \"complete pardon \" to the baseball great, who was banned from the sport in 1989 for betting on his own team.","label":"Spam"}
{"text":"The Chengdu Snow Village in Chinas Sichuan province is in trouble after visitors discovered the \"snow \" was actually made of cotton wool and soapy water. The village has closed and market regulation authorities are investigating the case of false advertising.","label":"Spam"}
{"text":"In an Instagram post, Canadian doubles tennis player Gaby Dabrowski revealed she was diagnosed with breast cancer during the summer of 2024, but kept it private while she continued to play.","label":"Spam"}
{"text":"Russian athletes will be permitted to compete at Paris 2024 under the designation of \"Individual Neutral Athlete \" (AIN), though they will not be allowed to represent Russia and will not be included in the medal table.","label":"Spam"}
{"text":"Bill May will compete at this years Olympics in Paris after decades of being barred from the competition because he is a man. Male artistic swimmers were finally allowed to compete in 2015 and this year the Olympics will be opened to two men on each eight-person team.","label":"Spam"}
{"text":"The star tight end says he will discuss the decision on the next episode of his podcast, due out next week.","label":"Spam"}
{"text":"The 38-year-old, who retired after the 2022 Olympics, has created The Snow League, with the inaugural event beginning in Aspen on Friday. The new format features a head-to-head battle and will be shown on NBC.","label":"Spam"}
{"text":"Freeride skier Kai Jones broke both his legs and tore both his meniscuses in a training crash two years ago. It took nine weeks of rehab for him to learn to walk again. His story is told in a new film, \"Falling into Place.","label":"Spam"}
{"text":"Nabil Bentaleb scored an emotional goal for Lille after making his return to football just eight months after suffering a cardiac arrest. The 30-year-old midfielder came on as a substitute against Rennes and scored less than five minutes after coming on.","label":"Spam"}
{"text":"Novak Djokovics surprise defeat to Botic van de Zandschulp marked his third consecutive defeat, the first time since 2018 the tennis player has suffered such a losing streak.","label":"Spam"}
{"text":"A lizard interrupted a F1 practice session in Singapore by running out onto the track, forcing a red flag. Marshals eventually removed the reptile so the session could resume.","label":"Spam"}
{"text":"Pickleballs popularity has grown in America and around the world, and now includes some of the biggest names in tennis, including Steffi Graf and Andre Agassi.","label":"Opportunity"}
{"text":"American tennis player Emma Navarro has won the Mérida Open Akron title, beating Colombian qualifier Emiliana Arango 6-0, 6-0. Navarro is cementing herself as a serious contender and is now the American nations fourth highest ranked female player. It was also a good weekend for another American tennis star, Jessica Pegula, who beat fellow American McCartney Kessler to win the ATX Open title in Austin.","label":"Branding"}
{"text":"Kylian Mbappé scored his first hat-trick for Real Madrid on Wednesday to help the Spanish side beat Manchester City 3-1 and progress to the Champions Leagues round of 16.","label":"Branding"}
{"text":"João Lucas Reis da Silva had a great week on the tennis court and he credits a selfie with his boyfriend that he posted on social media for giving him strength and confidence. The post received an overwhelming response from people all over the world. Reis da Silva came out as gay, and many see him as a role model even though he doesnt see himself as having a responsibility to be one.","label":"Spam"}
{"text":"Italian teenager Andrea Kimi Antonelli will replace seven-time F1 champion Lewis Hamilton at Mercedes next season, the team has confirmed. Antonelli, 18, will partner with George Russell at the Silver Arrows.","label":"Spam"}
{"text":"Canada mens soccer coach Jesse Marsch, an American, criticizes President Trumps comments about Canada becoming the 51st state of the US as \"unsettling and frankly insulting.","label":"Spam"}
{"text":"English striker Harry Kane scored twice as Bayern Munich beat Bayer Leverkusen 3-0 in the first leg of their Champions League last-16 tie. Kane, who has now scored 31 goals in all competitions this season, opened the scoring with a close-range header in the ninth minute.","label":"Spam"}
{"text":"Nabil Bentaleb scored an emotional goal for Lille after making his return to football just eight months after suffering a cardiac arrest. The 30-year-old midfielder came on as a substitute against Rennes and scored less than five minutes after coming on.","label":"Spam"}
{"text":"Top tennis players Jannik Sinner and Iga Świątek have faced differing bans for doping violations, causing controversy within the sport. Critics say the anti-doping process is \"rogue \" and that players believe favoritism is taking place.","label":"Spam"}
{"text":"History never forgets a champion. But for decades, two former winners of The Masters lay buried in unmarked graves.","label":"Spam"}
{"text":"A record 45 million people played golf in the US last year. With that number of golfers, there are almost as many lost balls. The consequences for the environment and marine life could be dire.","label":"Spam"}
{"text":"Synthetic fuels could be a game-changer for Formula Ones push towards net zero, but the high cost of production may stand in the way of their use in the sport.","label":"Spam"}
{"text":"A former Australian motorcycle gang member-turned-golfer has qualified for The Open Championship after winning the New Zealand Open.","label":"Spam"}
{"text":"Max Verstappen says he may retire from Formula One after being punished for swearing during a press conference. The Red Bull driver was sanctioned by the FIA for using inappropriate language.","label":"Spam"}
{"text":"After leaving behind a career in investment banking, British athlete Sophie Power has two world records to her name. The 42-year-old mother of three is also using her platform to provide a more realistic picture of what it takes to achieve.","label":"Spam"}
{"text":"President Trump signed an executive order establishing a White House task force for the 2026 World Cup that will oversee preparations for the high-profile tournament. More than 8 million international visitors are expected to come to the US for the monthlong tournament that kicks off in June 2026.","label":"Spam"}
{"text":"The former NHL ice hockey player says he suffered from \"dementia-like symptoms \" before taking the drug. Other athletes, including NFL quarterback Aaron Rodgers, have also spoken out in support of the drug.","label":"Spam"}
{"text":"Mikaela Shiffrins journey to a landmark 100th World Cup win has been a months-long ordeal, both mentally and physically, as she looks to overcome her injuries and mental health struggles.","label":"Spam"}
{"text":"The Spanish league game was briefly halted after an Athletic player reported racist abuse directed at his teammate to the referee, who then activated the leagues anti-racism protocol.","label":"Spam"}
{"text":"Arsenal beat PSV Eindhoven 7-1 in their Champions League round-of-16 tie, setting a new record for most goals scored by an away side in the knockout stages of the competition. Meanwhile, Real Madrid beat Atletico Madrid 2-1 in their Spanish rivalry.","label":"Spam"}
{"text":"Manchester Uniteds defeat to Tottenham means the club slips to 15th in the Premier League table, with manager Ruben Amorims job security potentially on the line.","label":"Spam"}
{"text":"Liverpool suffered a shock defeat at home against Plymouth Argyle, ending their hopes of an unprecedented quadruple and providing a ray of hope for the beleaguered team.","label":"Spam"}
{"text":"English striker Harry Kane set a record with his performance in Bayern Munichs 3-0 win over Bayer Leverkusen in the first leg of their Champions League matchup on Wednesday. Meanwhile, Liverpool goalkeeper Alisson helped his team edge out a 1-0 win over Paris Saint-Germain.","label":"Branding"}
{"text":"The fund will provide WTA players with financial support, comprehensive resources and paid maternity and parental support, as well as grants for egg and embryo freezing and IVF treatment.","label":"Spam"}
{"text":"Pam Shriver, one of the greatest doubles players in history, says her stolen grand slam trophies have been recovered and are in the possession of local police.","label":"Spam"}
{"text":"Antognolla, set to open in late 2026, will feature a 71-key hotel, a 3,000-square-meter wellness center and 17 bespoke residences on a 560-hectare estate. The site, which includes an 18-hole golf course, was once the site of a Benedictine monastery.","label":"Opportunity"}
{"text":"Australian golfer Steven Alderson made history by winning the Estrella Damm NA Andalucía Masters in Spain earlier this month. The victory made Alderson the first autistic winner on the Golf for the Disabled Tour.","label":"Opportunity"}
{"text":"Kipp Popert, the worlds No.1 disabled golfer, promised 12-year-old local talent Andreas Ma in Hong Kong that he would create more opportunities for disabled golfers after them meeting at the Hong Kong Open last month.","label":"Opportunity"}
{"text":"A strong wildlife presence is not unique to Australian golf courses, but few countries boast a range of animals as dangerous as Australia.","label":"Spam"}
{"text":"Rory McIlroy was the headline act at The Masters in 2011, but a devastating collapse on the back nine almost 10 years ago still haunts the now-33-year-old as he heads into this years tournament.","label":"Spam"}
{"text":"Max Verstappen climbed from 17th to first in dramatic fashion at the Sao Paulo Grand Prix, all-but sealing his fourth consecutive F1 drivers championship title.","label":"Branding"}
{"text":"The 40-year-old F1 driver discusses his move to Ferrari, ageism, and his commitment to winning.","label":"Spam"}
{"text":"Hamilton has penned a storied partnership with Mercedes in F1 thats seen the team win seven consecutive constructors titles and him claim six drivers championships. But the partnership will end in Abu Dhabi on December 8 after Hamilton signs with Ferrari and Mercedes recruits George Russell.","label":"Spam"}
{"text":"Carlos Sainz wins the Mexican Grand Prix, taking the checkered flag first to score his second race win of the season and the fourth of his Formula One career. The Spaniard is set to leave Ferrari at the end of this season, with the Italian team confirming in February that he would be replaced by seven-time world champion Lewis Hamilton.","label":"Branding"}
{"text":"Max Verstappen is favored to win the Las Vegas Grand Prix and clinch the Formula One championship. McLarens Lando Norris has been Verstappens closest challenger but is running out of time to extend his title hopes.","label":"Spam"}
{"text":"A home run from new signing Juan Soto helped New York Mets beat Houston Astros in Spring Training. The 26-year-olds historic $765m move was confirmed in December.","label":"Spam"}
{"text":"João Fonseca is fast becoming one of the most exciting talents in mens tennis. The 18-year-old opened his campaign at the BNP Paribas Open at Indian Wells with a three-set victory against Britains Jacob Fearnley.","label":"Branding"}
{"text":"Saudi Crown Prince Mohammed bin Salman says he \"doesnt care \" about the countrys investment in sport being called sportswashing as he aims to increase the nations GDP by 1.5%.","label":"Opportunity"}
{"text":"The 38-year-old, who retired after the 2022 Olympics, has created The Snow League, a new competition to help athletes accumulate qualification points for next years Winter Olympics in Italy.","label":"Spam"}
{"text":"Emma Raducanu spoke about the emotional toll of noticing a man reportedly under a restraining order following her around during a match, causing her to become visibly distressed and have to take a breather.","label":"Spam"}
{"text":"Jorge Martin is poised to achieve something never before seen in the modern MotoGP era as the first rider from an independent team to win the world title. This weekends race in Barcelona will be an emotional one for the Spaniard, as he leaves the Prima Pramac team with whom he has spent the last four years.","label":"Spam"}
{"text":"Australian driver Oscar Piastri has won the Azerbaijan Grand Prix, in only his second year as a Formula One driver. The 23 year olds victory has also helped his team, McLaren, take the lead in the constructors world championship.","label":"Spam"}
{"text":"Aston Martin has signed up legendary Formula One designer Adrian Newey, who is regarded as the sports greatest ever engineer. Newey, 65, has agreed a long-term deal with the British team and will join in March 2025, after ending a 20-year association with Red Bull. The move is a statement of intent from Aston Martin executive chairman and part-owner Lawrence Stroll, who believes Newey can deliver the team their first F1 world championship.","label":"Spam"}
{"text":"The Cleveland Cavaliers secured the first playoff spot of the NBA season after defeating the Miami Heat 112-107 on Wednesday night. The win extends the Cavaliers winning streak to 12 games, and they are now 52-10 on the season. The Heat, who were missing several key players, fell to 29-32.","label":"Spam"}
{"text":"After coming out in a social media post, João Lucas Reis da Silva says he was uplifted by the supportive reaction of others, and it gave him strength on the court.","label":"Spam"}
{"text":"Novak Djokovics surprise loss to Botic van de Zandschulp at Indian Wells marked his third consecutive defeat, the first time since 2018 the Serbian has suffered such a losing streak.","label":"Spam"}
{"text":"The Boston Celtics defeated the Los Angeles Lakers on Saturday night, ending the Lakers eight-game winning streak. The Lakers received another dominant performance from Jayson Tatum and Jaylen Brown. Meanwhile, LeBron James suffered an injury to his groin and had to leave the game.","label":"Spam"}
{"text":"Tennis player Novak Djokovic will be backed by his coaching teammate Andy Murray as he aims to win the Indian Wells title for the first time in a decade. Their collaboration started at the Australian Open in January, with Djokovic progressing to the semifinals before retiring his match against Alexander Zverev.","label":"Spam"}
{"text":"Top tennis players Jannik Sinner and Iga Świątek have faced differing bans for doping violations, causing controversy within the sport. Critics say lesser-known players face more severe punishments, exposing financial inequalities and issues with anti-doping processes. The cases have led to calls for greater equality in treatment.","label":"Spam"}
{"text":"Real Madrid fought back from behind to beat Manchester City 3-2 in a thrilling Champions League knockout tie on Tuesday.","label":"Spam"}
{"text":"Former NFL punter Chris Kluwe said he was fired from his job as a high school football coach following his protest at a local council meeting against a MAGA slogan plaque.","label":"Spam"}
{"text":"The Cleveland Cavaliers secured the first playoff spot of the season after beating the Miami Heat 112-107 on Wednesday night. The Cavaliers are now 52-10 on the season.","label":"Spam"}
{"text":"The 2026 World Cup final, hosted in the United States, will include a halftime show for the first time, FIFA president Gianni Infantino has confirmed.","label":"Opportunity"}
{"text":"Australian driver Oscar Piastri has won the Azerbaijan Grand Prix, in only his second year as a Formula One driver. The 23 year olds victory raises his team McLaren to the lead in the constructors world championship, ahead of previous winners Red Bull. His teammate Lando Norris also had a strong race, climbing from 15th place to finish fourth, ahead of championship leader Max Verstappen.","label":"Branding"}
{"text":"The NFL Scouting Combine sees 324 of the college games top prospects undertake a series of drills in front of scouts ahead of the NFL Draft. Heres all you need to know.","label":"Spam"}
{"text":"The 27-year-old tennis star plans to seek her fifth major title – which would be her first since becoming a mother in 2023 – and is eyeing Wimbledon and the French Open.","label":"Spam"}
{"text":"Lewis Hamilton is feeling optimistic about his new adventure joining the Ferrari team, saying he feels invigorated about the new season. The seven-time world champion shocked fans when he made the switch after spending 12 years at Mercedes.","label":"Spam"}
{"text":"From Disney Channel star to a professional boxer, Jake Paul has become one of the most talked about athletes in the world.","label":"Spam"}
{"text":"Top tennis players Jannik Sinner and Iga Świątek have faced differing bans for doping violations, causing controversy within the sport. Critics say the anti-doping process is \"rogue \" and that players believe favoritism is taking place.","label":"Spam"}
{"text":"Boston Celtics guard Derrick White was injured Thursday night after losing a tooth during a game against the Philadelphia 76ers. He picked the tooth up off the floor and decided to keep playing.","label":"Spam"}
{"text":"Chelsea spent €1.656 billion on player transfers, according to a report by UEFA, making their squad the most expensive ever assembled in Europe in terms of transfer fees.","label":"Spam"}
{"text":"Chelsea spent €1.656bn on player transfers, according to a UEFA report, topping the previous highest spend by Manchester United in 2023. The report also highlighted the revenue of top European clubs, with English clubs dominating.","label":"Spam"}
{"text":"Top tennis players Jannik Sinner and Iga Świątek have faced differing bans for alleged doping, causing controversy within the sport. Some say the anti-doping process is \"rogue \" and that players are treated differently based on their status.","label":"Spam"}
{"text":"Synthetic fuel could be a game changer for Formula One, but its expensive production means its introduction could be some time away yet.","label":"Spam"}
{"text":"The Washington Commanders have agreed to trade for star wide receiver Deebo Samuel from the San Francisco 49ers in exchange for a fifth-round draft pick.","label":"Spam"}
{"text":"A new CNN docuseries traces the story of Kobe Bryant from his childhood in Italy to his athletic superstardom and provides an intimate look at his aspirations as a storyteller and a father.","label":"Spam"}
{"text":"The US could struggle to effectively stage the 2026 World Cup unless big changes are made to the countrys travel system, two top travel executives have warned. Lengthy wait times for fan visa approvals, outdated technology and staffing shortages could see visitors face long waits at airports, according to the US Travel Association and MGM Resorts International. The 2026 tournament, jointly hosted by the US, Mexico and Canada, is set to be the largest in history, with an estimated six to eight million foreign visitors.","label":"Opportunity"}
{"text":"Japan scored at the start of each half to beat the US 2-1 and win the SheBelieves Cup for the first time. It was the Nadeshikos first victory over the US in 14 matches, stretching back to 2012.","label":"Spam"}
{"text":"The Spanish league game was briefly halted after an Athletic player reported racist abuse directed toward his teammate to the referee, who then activated the leagues anti-racism protocol.","label":"Spam"}
{"text":"The fund will provide WTA players with financial support, resources and paid maternity and parental leave. It has been established to help players plan for and around pregnancy and childcare commitments.","label":"Spam"}
{"text":"Malbon Golf aims to use fashion to inspire a new generation to take up the sport. The brands social media storm at this years Masters was not quite part of the plan, though.","label":"Spam"}
{"text":"On February 6, 1971, Alan Shepard became the first man to play golf on the moon. Now, an expert in restoring Apollo-era footage believes he may have found the missing second shot.","label":"Spam"}
{"text":"F1 Experiences offers a range of packages at all 24 races in the calendar to bring fans closer to the action. Packages can include everything from a simple race ticket to behind-the-scenes access and tours of the paddock.","label":"Spam"}
{"text":"Jorge Martin is poised to achieve something never before seen in the modern MotoGP era as the first rider from an independent team to win the world title. This weekends race in Barcelona will be an emotional one for the Spaniard, as he leaves the Prima Pramac team with whom he has spent four years, to join the factory Aprilia squad.","label":"Spam"}
{"text":"The annual report cards released by the NFLPA sees players across the league rate teams across multiple categories and give their thoughts on playing for them. The Miami Dolphins were ranked first, while the Arizona Cardinals fell from 27th a year ago to 32nd after a scathing review.","label":"Spam"}
{"text":"Novak Djokovics surprise loss to Botic van de Zandschulp at Indian Wells marked his third consecutive defeat, the first time since 2018 the Serbian has suffered such a losing streak.","label":"Spam"}
{"text":"American Grant Fisher broke the indoor 5,000-meter world record after having broken the 3,000-meter indoor world record six days prior.","label":"Spam"}
{"text":"Kansas City Chiefs wide receiver Xavier Worthy will not face charges in an alleged assault case in Texas, according to local authorities.","label":"Spam"}
{"text":"Alabama and St. Johns took wins in their final regular season games in dramatic style, sealing victory with overtime buzzer-beaters.","label":"Spam"}
{"text":"Fenerbahce manager Jose Mourinho has been accused of making racist statements by Turkish football club Galatasaray, who now plan to pursue criminal charges against the former Chelsea and Real Madrid boss.","label":"Spam"}
{"text":"Lewis Hamilton has expressed his excitement after officially joining Ferrari, calling the occasion \"a new era\". The seven-time Formula One world champion, who has swapped Mercedes for the Italian team, also said he was keen to \"write a new story \" with the team. Hamilton, 40, has won six of his seven world titles with Mercedes.","label":"Spam"}
{"text":"Lionel Messi has been fined by Major League Soccer for grabbing the neck of an opposing coach after a game. Messis Inter Miami teammate, Luis Suárez, was also fined for the same incident.","label":"Spam"}
{"text":"Jimmy Johnson, the Hall of Fame coach who won two Super Bowls and a college national championship, announced his retirement Monday from Fox Sports, where he worked as an NFL analyst.","label":"Spam"}
{"text":"Michelle Cooper scored the winning goal as the US womens national football team beat Australia 2-1 in the SheBelieves Cup on Sunday. The result set up a final-game showdown with Japan, which beat Colombia 4-1.","label":"Spam"}
{"text":"Alexander Zverevs hopes of overtaking Jannik Sinner and becoming the worlds top ranked mens tennis player suffered a serious blow after losing in the second round of the Indian Wells tournament to Tallon Griekspoor. Zverev had won the first set but ultimately fell 4-6, 7-6 (5), 7-6 (4) after being unable to serve out the match at 6-5 in the second set.","label":"Spam"}
{"text":"A record 45 million people played golf in the US last year. With more people playing comes the loss of more balls. One expert estimates as many as 5 billion balls are lost each year worldwide.","label":"Opportunity"}
{"text":"On February 6, 1971, Alan Shepard became the first man to play golf on the moon. Now, an expert in restoring Apollo-era footage believes he might have found the missing second golf ball.","label":"Spam"}
{"text":"Max Verstappen claimed his fourth consecutive Formula One World Drivers Championship at the Las Vegas Grand Prix on Sunday, though George Russell took the race win.","label":"Spam"}
{"text":"\"NBA Centel\" was a popular parody account that shot to fame for its humorous posts on former Twitter, now known as X. But on Wednesday the account seemed to be banned, with several NBA teams paying tribute to it on the platform.","label":"Spam"}
{"text":"Former NHL ice hockey player Daniel Carcillo says he had suicidal thoughts and suffered from dementia-like symptoms after multiple concussions. He says a dose of psilocybin, the active ingredient in magic mushrooms, helped alleviate his symptoms and gave him a new \"zest for life\".","label":"Spam"}
{"text":"Both Tiger Woods and Rory McIlroys teams have been eliminated from the new TGL league after failing to qualify for the playoffs. New York Golf Club, featuring Rickie Fowler and Xander Schauffele, are through to the final four.","label":"Spam"}
{"text":"Saturdays college basketball action saw No.7 Alabama defeat No.1 Auburn and No.6 St. Johns beat No.20 Marquette, both in overtime with buzzer-beaters. Duke also beat rival North Carolina to clinch the ACC regular-season title.","label":"Spam"}
{"text":"Angel Cabrera, a two-time major winner, will be returning to the Masters next month after serving two years in prison for domestic abuse.","label":"Spam"}
{"text":"Mikaela Shiffrins journey to a landmark 100th World Cup win has been a mentally and physically challenging one, involving several crashes and injuries, including severe muscle trauma and a puncture wound to the abdomen, as well as post-traumatic stress disorder. She discusses her struggles and her hopes for the future in this article.","label":"Spam"}
{"text":"Jon Cooper, the Canadian coach of the US hockey team that beat Canada in a recent face-off, discusses how politics influenced the tournament and the sport as a whole.","label":"Spam"}
{"text":"Two promising young female athletes died by suicide after suffering <a href=\"https://www.cnn.com/2022/06/13/sport/ellie-soutter-kelly-catlin-concussion-suicide-afp-intl/index.html \" target=\"_blank\">serious head injuries</a> and struggling to get help.","label":"Spam"}
{"text":"Arsenal beat PSV Eindhoven 7-1 in their Champions League tie, securing their place in the quarter-finals. The result was historic, as no away team had ever scored so many goals in the knockout stages of the competition. Meanwhile, Real Madrid beat Atletico Madrid 2-1 in the Spanish capital, though the winner will have to wait for the second leg to secure their place in the last eight.","label":"Spam"}
{"text":"Chelsea spent €1.656bn on player transfers, according to a report by UEFA, a sum that surpasses the cost of Manchester United and Real Madrids squads. Despite the spending, Chelsea only managed a sixth-place finish in the Premier League last season.","label":"Spam"}
{"text":"Emma Raducanu speaks for the first time about the incident in Dubai and reveals shes since stepped up her security in the wake of the experience.","label":"Spam"}
{"text":"The 28-year-old American golfer had a dominant season, winning nine times, including at the Paris Olympics, and retaining his Masters title.","label":"Spam"}
{"text":"A lizard halted proceedings during a F1 practice session, with drivers perplexed and laughing as they watched marshals chase it down the track.","label":"Spam"}
{"text":"Charles Leclerc took the win at the US Grand Prix, with Lando Norris losing out after a controversial penalty saw him drop from third to fourth.","label":"Spam"}
{"text":"Max Verstappen climbed from 17th to first in dramatic fashion at the Sao Paulo Grand Prix, all-but sealing his fourth consecutive F1 drivers championship title.","label":"Branding"}
{"text":"The former F1 supremo has pleaded guilty to fraud, and will sell the collection -- which includes world championship-winning Ferraris -- through sports and race car dealer Tom Hartley Jr.","label":"Spam"}
{"text":"The Spurs coach confirmed he will not be returning to the bench this season as he continues to recover from a stroke suffered last year.","label":"Spam"}
{"text":"An anonymous NFL team proposed banning the \"Tush Push \" play that has been a favorite of the Philadelphia Eagles, according to reports. The \"Tush Push, \" also called the \"Brotherly Shove, \" is a version of the quarterback sneak used by the Eagles. The Green Bay Packers, who lost to the Eagles in the playoffs, are said to be behind the proposal.","label":"Spam"}
{"text":"Jon Cooper, the Canadian coach of the US hockey team that beat Canada in a recent face-off, discusses how politics influenced the tournament and the sport as a whole.","label":"Spam"}
{"text":"The retired swimmer probably lost all 10 of his Olympic medals, as well as other belongings, in the Pacific Palisades wildfire, says hes devastated","label":"Spam"}
{"text":"Competitive breakdancer Menno van Gorp is training hard ahead of the 2024 Paris Olympics, taking inspiration from jazz musician Miles Davis. The introduction of breaking as a sport at the Olympics has been met with mixed feelings from the dance community. Van Gorp, who is from the Netherlands, is a medal hopeful and is combining intensive dance training with gym work and calisthenics.","label":"Spam"}
{"text":"Boston Celtics guard Derrick White was reminded of his infamous tooth sacrifice last season, when he gave up a tooth on the court, when he was hit in the face against the Philadelphia 76ers and lost a temporary four-tooth bridge.","label":"Spam"}
{"text":"Saudi Crown Prince Mohammed bin Salman says he doesnt \"care about the countrys investment in sport being described as sportswashing, \" in an interview that aired Wednesday.","label":"Opportunity"}
{"text":"Geoff Freeman of the US Travel Association and William Hornbuckle of MGM Resorts International told CNN Sport they have real concerns about whether the US travel system can handle the influx of foreign travelers for the 2026 World Cup.","label":"Spam"}
{"text":"Former Spanish soccer chief Luis Rubiales has been fined $11,270 after being accused of sexually assaulting a player during a medal ceremony. Rubiales was acquitted of coercion, with the judge saying the act was \"sporadic \" and \"always reprehensible.","label":"Spam"}
{"text":"The US Open mixed doubles will be held earlier than usual this year, prompting anger from players including defending champions Sara Errani and Andrea Vavassori, who called the decision \"profoundly unjust\".","label":"Opportunity"}
{"text":"Sergio Garcia has submitted his application to rejoin the DP World Tour and will be eligible to play in the 2025 Ryder Cup, drawing level with records for most appearances playing for Europe.","label":"Spam"}
{"text":"A record 45 million people played golf in the US last year. With more people playing comes the loss of more balls. Estimates for the number of balls lost by the average golfer per round typically vary between one and four.","label":"Opportunity"}
{"text":"Golfing trips to his favorite place helped a grieving father find a way to go on after the death of his son. Jim Hartsell details his journey of healing in book \"When Revelation Comes.","label":"Spam"}
{"text":"The caddies at Augusta National were mostly black men from the Sand Hills neighborhood in Augusta, Georgia. They learned how to read greens and became amateur psychologists. Many of them had nicknames like \"Cemetery Perteet \" and \"Iron Man Avery. \" By the 1980s, most of the original caddies were gone as players were allowed to use their tour caddies.","label":"Spam"}
{"text":"It takes hundreds of staff to transport the entire Formula One operation from country to country during the racing season. Teams have to transport around 50 tons of freight to every Grand Prix.","label":"Spam"}
{"text":"Max Verstappen says he is frustrated with the FIA after being punished for using a swear word during a press conference, saying the ruling could hasten his retirement.","label":"Spam"}
{"text":"Belinda Bencic won the Abu Dhabi Open on Saturday, claiming her first WTA title as a mom and the first for a mother since May 2023. Bencic says the support of her husband and nine-month-old daughter Bella in the stands helped her to victory.","label":"Spam"}
{"text":"Lando Norris took the checkered flag in the Dutch Grand Prix on Sunday, holding off a charging Max Verstappen to reignite the drivers world championship with nine races left in the season.","label":"Spam"}
{"text":"The fund will provide WTA players with financial support, comprehensive resources and access to grants for egg and embryo freezing and IVF treatment.","label":"Spam"}
{"text":"The upcoming 2024 Olympics in Paris is fast approaching and one entrepreneur has a different idea of what the former motto of the Games, \"Faster, Higher, Stronger, \" might represent. The Enhanced Games says it is an \"alternative \" to the Olympics and allows athletes to use performance-enhancing drugs. The idea has drawn criticism from anti-doping officials and sporting organizations.","label":"Spam"}
{"text":"Lionel Messi has been fined by Major League Soccer for grabbing the neck of an opposing coach after a game. Messi had received a yellow card after a heated exchange with the referee during the match.","label":"Spam"}
{"text":"Spanish womens soccer club Espanyol has expressed its discontent towards the behavior of Barcelona player Mapi León during a match between the two teams.","label":"Spam"}
{"text":"American soccer player Crystal Dunn talks about her move to Paris Saint-Germain, the challenges of being a mother and player, and the differences between US and European leagues.","label":"Spam"}
{"text":"Rory McIlroy ended 2024 with his third career win at the season-ending DP World Tour Championship in Dubai on Sunday, a sixth Race to Dubai victory for the Northern Irishman.","label":"Spam"}
{"text":"Australian racer Daniel Ricciardo is known for his fearless driving and amicable personality, traits that hes had since his early days in Formula One.","label":"Spam"}
{"text":"Hamilton will end his partnership with Mercedes in Abu Dhabi on December 8; the pair have enjoyed seven consecutive constructors titles and six drivers titles; the Brit will join Ferrari, while Mercedes will be spearheaded by George Russell.","label":"Spam"}
{"text":"Dallas Mavericks star Kyrie Irving has suffered a torn ACL in his left knee and is likely to miss the rest of the NBA season, the team announced Tuesday.","label":"Spam"}
{"text":"Alabama and St. Johns took wins in their final regular season games in dramatic style, sealing victory with overtime buzzer-beaters.","label":"Spam"}
{"text":"The match, which was scheduled to kick off on Saturday, was postponed following the death of the team doctor. No cause of death was provided.","label":"Spam"}
{"text":"Yared Nuguse never dreamed of being a professional runner, let alone an Olympic medalist. But life has a funny way of taking unlikely turns and his enormous talent and work ethic has led him to great success.","label":"Spam"}
{"text":"While testing his new camera, Bruno Lobo spotted a woman drowning and used his kite surfing skills to help bring her to safety. Lobo competed in the Olympics last year in Paris.","label":"Spam"}
{"text":"US sprinter Fred Kerley, who won a bronze medal in the mens 100m at the 2024 Paris Olympics, was arrested and stun-gunned in a confrontation with police officers in Miami on Thursday night.","label":"Spam"}
{"text":"Neeraj Chopra is an anomaly in a country obsessed with cricket: the champion javelin thrower is fast becoming one of Indias most celebrated sporting heroes.","label":"Branding"}
{"text":"Greg Gumbel, a longtime sports broadcaster and host of five Super Bowls and the NCAA mens basketball tournament, has died at 78 after a battle with cancer, his family said.","label":"Spam"}
{"text":"Golf: Scottie Scheffler will miss the start of the PGA Tour season in Hawaii after suffering an injury on Christmas Day.","label":"Spam"}
{"text":"Mondo Duplantis is the dominant force in pole vaulting, breaking the world record seven times. The Swede, who competes for his mothers native country, has won Olympic gold and four world championship titles. He talks about his love for the sport — and his desire to dominate it.","label":"Spam"}
{"text":"Paulo Fonseca, the head coach of French soccer team Olympique Lyonnais, has been given a nine-month suspension after confronting a referee.","label":"Spam"}
{"text":"Neymar made his first appearance for his boyhood club Santos since returning; the Brazilian played the second half in a draw with Botafogo;","label":"Spam"}
{"text":"A five-star luxury resort and golf course near the Nepalese capital offers a serene getaway for visitors to the region.","label":"Spam"}
{"text":"Malbon Golfs apparel was at the center of a \"sweatergate \" debate at this years Masters. The brands founders say they wanted to inject some flair into the sports wardrobe. They spoke to CNN about plans for the brand and their strategy for attracting younger people to the game.","label":"Spam"}
{"text":"Lewis Hamilton has posted on Instagram after completing his first day at Ferrari, calling it a dream. The seven-time Formula One world champion is dressing smart in photos, alongside a Ferrari supercar. He joins from a successful 12 years at Mercedes, winning six of his seven world titles there. He will be partnering Charles Leclerc at the team.","label":"Spam"}
{"text":"After 186 tournaments without a win, American golfer Brian Campbell has tasted victory at the Mexico Open. A sudden death play-off was required to decide the outcome, and Campbell benefited from a miraculous slice of luck to keep his hopes alive. The win earns him $1,260,000 and a place at some of golfs most prestigious tournaments.","label":"Spam"}
{"text":"Jessica Pegula, who won the ATX Open, has earned praise on social media for her generosity towards her fellow players. After beating compatriot McCartney Kessler, Pegula offered her private jet to those who were also in the tournament to travel on to California for the Indian Wells tournament, which begins this week.","label":"Spam"}
{"text":"The English football club, which finished eighth in the Premier League last season, has been plagued by financial losses.","label":"Spam"}
{"text":"Simona Halep announced her tennis retirement on Tuesday following a doping ban and subsequent injuries that affected her performance. Halep won two Grand Slam titles and was the number one ranked female player.","label":"Spam"}
{"text":"At the Hero World Challenge, Scottie Scheffler secured his ninth title of the year, giving him the highest win rate in golf. The 28-year-old is the first player since Tiger Woods in 2009 to be the worlds No. 1 player for an entire calendar year.","label":"Spam"}
{"text":"Joel Dahmen is in danger of losing his PGA Tour card after being penalized four shots at the Shriners Children’s Open for having too many clubs in his bag.","label":"Spam"}
{"text":"The former Formula One boss, who recently pleaded guilty to fraud, owns a car collection that includes world championship-winning Ferraris and is worth \"hundreds of millions of dollars.","label":"Spam"}
{"text":"Charles Leclerc took the win at the US Grand Prix, with Lando Norris losing out on third place to Max Verstappen following a controversial penalty.","label":"Spam"}
{"text":"Max Verstappen won the Qatar Grand Prix, despite accusing George Russell of trying to \"screw him over \" during qualifying.","label":"Spam"}
{"text":"Lionel Messi has been fined by Major League Soccer for grabbing the neck of an opposing coach during a match. Messis teammate Luis Suárez also received a fine for the same incident.","label":"Spam"}
{"text":"The Washington Nationals will continue to have their games televised locally on the Mid-Atlantic Sports Network under a new deal until the end of the 2025 season, with the team then free to explore other offers.","label":"Spam"}
{"text":"Former FIFA president Sepp Blatter and French soccer great Michel Platini are due in court in Switzerland on Monday accused of fraud. Both men were acquitted in 2022.","label":"Spam"}
{"text":"Carlos Sainz wins the Mexican Grand Prix, taking the checkered flag first to score his second race win of the season. The Ferrari driver qualified on pole position and snatched the race lead from title contender Max Verstappen to take a comfortable victory.","label":"Spam"}
{"text":"Yared Nuguse never dreamed of being a professional runner, let alone an Olympic medalist. But life has a funny way of taking unlikely turns and his enormous talent and work ethic has led him to great success.","label":"Spam"}
{"text":"English striker Harry Kane scored twice as Bayern Munich beat Bayer Leverkusen 3-0 in their Champions League last-16 first leg on Wednesday. Kane, who was playing at the Allianz Arena, scored one goal in each half and his tally of 31 goals in all competitions this season is the most in Europes top five leagues. He also equaled a European Cup single-season scoring record held by Manchester Uniteds Dennis Viollet in 1956-57.","label":"Branding"}
{"text":"A new CNN docuseries traces the story of Kobe Bryant from his childhood in Italy to his athletic superstardom and provides an intimate look at his post-NBA aspirations as a storyteller and as a father.","label":"Spam"}
{"text":"Lionel Messi has been fined by Major League Soccer for grabbing the neck of an opposing coach during a match. Messis teammate Luis Suárez also received a fine for the same incident.","label":"Spam"}
{"text":"Real Madrid fought back from behind to beat Manchester City 3-2 in a thrilling Champions League knockout tie and book a spot in the last 16.","label":"Spam"}
{"text":"Jessica Pegula, who won the ATX Open, has been praised for her generosity towards her fellow players. The American offered her private jet to those who competed in the tournament to travel to Indian Wells.","label":"Spam"}
{"text":"Jannik Sinner has accepted a three-month ban from tennis after twice testing positive for the banned substance Clostebol in March 2024, according to the World Anti-Doping Agency. The mens world No.1 will be banned from February 9 to May 4, meaning he will be eligible to play in the French Open, the next grand slam on the calendar.","label":"Spam"}
{"text":"TGL, an indoor golf league helped by Tiger Woods and Rory McIlroy, has finally released its schedule and will start in January 2025, after its venue collapsed due to a power failure. The league hopes to attract younger audiences to golf.","label":"Spam"}
{"text":"Former FIFA president Sepp Blatter and French football legend Michel Platini will appear in court accused of fraud. The pair were acquitted in 2022 but the Swiss federal prosecutor has appealed the decision.","label":"Spam"}
{"text":"Teenager João Fonseca won the Argentina Open on Sunday, announcing himself as one of tennis brightest talents. The 18-year-old Brazilian became the second-youngest South American to win a title in the Open Era.","label":"Spam"}
{"text":"The \"White Witch \" of Rose Hall in Jamaica is a popular figure in local folklore and a cornerstone of tourism in the region. But is she real? Some believe the story of the 19th century plantation owner is an amalgamation of fact and fiction.","label":"Spam"}
{"text":"Lando Norris took the win for McLaren at the Singapore Grand Prix, cutting into Max Verstappens lead in the drivers championship. McLaren also widened their lead in the constructors championship.","label":"Spam"}
{"text":"Rising star Andrea Kimi Antonelli has passed his driving test six weeks before making his Formula One debut. The 18-year-old will drive for Mercedes in the Australian Grand Prix. Rules were changed to allow him to participate in F1 practice sessions ahead of his 18th birthday.","label":"Branding"}
{"text":"Australian Formula One driver Daniel Ricciardo has left the RB team with immediate effect and will be replaced by Liam Lawson, the team has announced.","label":"Spam"}
{"text":"Nikola Jokić recorded the first ever triple-double of at least 30 points, 20 rebounds and 20 assists in NBA history as the Denver Nuggets defeated the Phoenix Suns 149-141 in overtime.","label":"Spam"}
{"text":"Jimmy Johnson, the Hall of Fame coach who won two Super Bowls and a college national championship, announced his retirement Monday from Fox Sports, where he worked as an NFL analyst.","label":"Spam"}
{"text":"Jessica Pegula, who won a tennis tournament in Texas on Sunday, invited fellow tournament participants to hitch a ride with her on her private jet — avoiding a long journey to California for their next tournament.","label":"Spam"}
{"text":"Jimmy Johnson, the Hall of Fame coach who won two Super Bowls and a college national championship, announced his retirement from Fox Sports on Monday.","label":"Spam"}
{"text":"Nikola Jokić recorded the first ever triple-double of at least 30 points, 20 rebounds and 20 assists in NBA history on Friday night.","label":"Spam"}
{"text":"A traumatic crash in the Wyoming backcountry threatened to derail his career, but 18-year-old Kai Jones is now back on top of his game.","label":"Spam"}
{"text":"Paulo Fonseca, the head coach of French soccer team Olympique Lyonnais, has been given a nine-month suspension after confronting a referee.","label":"Spam"}
{"text":"Pickleballs popularity has grown in recent years. Heres how the sport complements tennis, according to tennis great Steffi Graf, and why the games fast pace challenges her in new ways.","label":"Spam"}
{"text":"Catarina Macario opened the scoring for the USWNT before Sentnors second-half strike to seal a 2-0 victory over Colombia in their SheBelieves Cup opener.","label":"Spam"}
{"text":"Liverpool suffered a shock defeat against Plymouth Argyle in the FA Cup on Sunday, ending the teams hopes of an unprecedented quadruple.","label":"Spam"}
{"text":"Neymar made his first appearance for his boyhood club Santos since returning; the Brazilian played the second half in a draw with Botafogo;","label":"Spam"}
{"text":"Teenager João Fonseca stunned local favorite Francisco Cerúndolo to win his first ATP Tour title in Buenos Aires on Sunday. The 18-year-old Brazilian is the lowest-ranked champion in the history of the Argentina Open.","label":"Spam"}
{"text":"The PGA of America is facing criticism over the cost of tickets to the Ryder Cup, with some costing just under $750, making it prohibitively expensive for many fans. The event, which takes place every two years and sees Europe and the US go head-to-head in mens golf, is a sellout, with fans selected at random for ticket opportunities.","label":"Opportunity"}
{"text":"Kipp Popert, the worlds No.1 disabled golfer, promised 12-year-old local talent Andreas Ma that he will create a pathway for disabled golfers in the future. Popert included the young golfer who was born with a congenital absence of his left hand in a chipping class during the Hong Kong Open last month.","label":"Spam"}
{"text":"The Boston Celtics defeated the Los Angeles Lakers on Saturday night, snapping the Lakers eight-game winning streak. The Lakers star LeBron James suffered an injury to his groin and did not play in the second half. The Lakers and Celtics are both second in their conferences.","label":"Spam"}
{"text":"Kansas City Chiefs wide receiver Xavier Worthy will not face charges in an alleged assault case in Texas, according to local authorities.","label":"Spam"}
{"text":"\"NBA Centel\" was a popular parody account that shot to fame for its humorous, fake viral posts about the NBA on Twitter — formerly known as X. Even NBA teams and stars were aware of it, but it appears the account has now been banned on the platform.","label":"Spam"}
{"text":"The question of whether Simone Biles will participate in the 2028 Olympic Games in Los Angeles is one that has triggered much debate, but the American is yet to make a concrete decision.","label":"Spam"}
{"text":"Nikola Jokić recorded the first ever triple-double of at least 30 points, 20 rebounds and 20 assists in NBA history on Friday night.","label":"Spam"}
{"text":"At least 42 countries awarded Olympic gold medalists over $100,000 at the Paris Olympics — but only 23 countries and Taiwan did the same for their Paralympic counterparts, a CNN analysis has found.","label":"Spam"}
{"text":"Yaroslava Mahuchikh is one of Ukraines biggest stars, and is hoping to bring attention to her countrys plight on the global stage.","label":"Spam"}
{"text":"Jon Cooper, the Canadian coach of the US hockey team that beat Canada in a recent face-off, talks about how politics impacted the game and his players.","label":"Spam"}
{"text":"Rory McIlroy was the headline act at The Masters in 2011, but a disastrous final day saw his hopes sink like his tee shot at the par-five 13th.","label":"Spam"}
{"text":"It takes thousands of hours of hard work and meticulous planning to transport the Formula One circus – comprising some 4,000 people and 50 tons of freight per team – to a new country every other week.","label":"Spam"}
{"text":"A home run from new signing Juan Soto sent the crowd wild as the New York Mets beat the Houston Astros in Spring Training.","label":"Spam"}
{"text":"The sporting world gathered on Sunday in memory of the figure skaters, coaches and family members who died in a mid-air collision over the Potomac river last month.","label":"Spam"}
{"text":"Dallas Mavericks star Kyrie Irving is exploring a switch of international allegiance to represent Australia, the country of his birth. The nine-time NBA All-Star holds dual American and Australian citizenship.","label":"Spam"}
{"text":"The Boston Celtics defeated the Los Angeles Lakers on Saturday night, snapping the Lakers eight-game winning streak. The Lakers star player Lebron James suffered an injury to his groin and left the game. The Lakers and the Celtics are both second in their conferences.","label":"Spam"}
{"text":"Paris is spending millions to clean up the River Seine ahead of this years Olympic Games, but testing shows the water still contains high levels of E. coli bacteria that could pose a serious health risk to athletes.","label":"Spam"}
{"text":"Breaking, or elite breakdancing, is the newest addition to the summer Olympics lineup. The process of adding a sport to the Olympic program is a complicated one that comes with a long list of criteria.","label":"Spam"}
{"text":"Boston Celtics guard Derrick White was reminded of his infamous tooth sacrifice last season, when he gave up a tooth on the court, when he was hit in the face against the Philadelphia 76ers and lost a temporary four-tooth bridge.","label":"Spam"}
{"text":"The seven surviving players who made up the US Olympic mens basketball team that beat the Dream Team in a scrimmage 33 years ago are sharing their story in a new documentary.","label":"Spam"}
{"text":"Trump said on Truth Social he will issue a \"complete pardon \" to the baseball great, who was banned from the sport in 1989 for betting on his own team.","label":"Spam"}
{"text":"Dallas Mavericks star Kyrie Irving has suffered a torn ACL in his left knee, an injury that is likely to see him miss the rest of the NBA season, the team announced Tuesday.","label":"Spam"}
{"text":"Marty Sheargold, a radio host and comedian, has been fired after a misogynistic tirade about the Australian womens soccer team, Matildas. Sheargolds comments, which were posted on Instagram, triggered widespread condemnation and he later apologized. However, the teams soccer governing body said the incident was a reminder of the responsibility of media outlets to foster respectful discussions about womens sport.","label":"Spam"}
{"text":"Kylian Mbappé scored his first hat-trick for Real Madrid against Manchester City on Wednesday to send them through to the Champions League round of 16. The win came in convincing fashion, 3-1 on the night and 6-3 on aggregate. Citys earliest exit from the competition came under manager Pep Guardiola.","label":"Branding"}
{"text":"Belinda Bencic won the Abu Dhabi Open on Saturday, claiming her first WTA title as a mom. The Swiss player, cheered on by her husband and daughter, came from a set down to beat Ashlyn Krueger.","label":"Spam"}
{"text":"Trump said on Truth Social he will issue a pardon to the baseball great in the coming weeks while MLB considers a petition to remove Rose from its ineligible list.","label":"Spam"}
{"text":"Brazilian teenager João Fonseca is fast becoming one of the most exciting talents in mens tennis, after an impressive win at the Argentina Open last month. The 18-year-old opened his campaign at Indian Wells with a tough victory against Britains Jacob Fearnley.","label":"Branding"}
{"text":"Jesse Marsch, the coach of Canadas mens soccer team, has criticised President Donald Trumps comments about Canada, calling them \"unsettling and frankly insulting\". Trump has repeatedly said that Canada should become the 51st state of the US.","label":"Spam"}
{"text":"Paulo Fonseca, the head coach of French soccer team Olympique Lyonnais, has been given a nine-month suspension after confronting a referee.","label":"Spam"}
{"text":"The Washington Commanders have agreed to trade for star wide receiver Deebo Samuel from the San Francisco 49ers in exchange for a fifth-round draft pick.","label":"Spam"}
{"text":"Former FIFA president Sepp Blatter and French football great Michel Platini are due to appear in court in Switzerland on Monday accused of fraud.","label":"Spam"}
{"text":"The WNBAs Toronto Tempo have announced tennis legend Serena Williams as a member of their ownership group ahead of their inaugural season in 2026. Williams, who already owns a stake in soccer team Angel City FC and the NFLs Miami Dolphins, said the move was about \"showcasing the true value and potential of female athletes\".","label":"Spam"}
{"text":"The Washington Nationals will continue to have their games televised by the Mid-Atlantic Sports Network, with an option to explore alternatives after the 2025 season, MLB announced Monday.","label":"Spam"}
{"text":"Spanish soccer club Espanyol has expressed its discontent toward the behavior of Barcelona Femení player Mapi León during a match between the two clubs.","label":"Spam"}
{"text":"Australian driver known for his trademark smile and competitive nature. Now 35, he is one of the most experienced drivers on the F1 circuit and hopes to inspire the next generation.","label":"Spam"}
{"text":"Tennis legend Serena Williams is adding a new title to her illustrious portfolio: WNBA team owner.","label":"Spam"}
{"text":"From Disney Channel star to controversial boxing champion, YouTuber Jake Paul discusses his rapid rise to sporting stardom, his failed fight with Canelo Álvarez, his dream showdown with Conor McGregor, and more.","label":"Spam"}
{"text":"Yared Nuguse never dreamed of being a professional runner, let alone an Olympic medalist. Aged 14, his sporting achievements amounted to a spot on the high school bowls team, while his career plans involved becoming a dentist.","label":"Spam"}
{"text":"Former FIFA president Sepp Blatter and former UEFA president Michel Platini will face a court hearing in Switzerland on Monday accused of fraud. Both men were acquitted of the charges in 2022.","label":"Spam"}
{"text":"Moise Kean, the Italian soccer player, has been discharged from hospital after collapsing in a game at the weekend. The striker received treatment after his head made contact with an opponents knee.","label":"Spam"}
{"text":"Manchester Uniteds defeat to Tottenham means the club slips to 15th in the Premier League table, with manager Ruben Amorims job security potentially on the line.","label":"Spam"}
{"text":"Alexander Zverevs hopes of overtaking Jannik Sinner and becoming the worlds top ranked mens tennis player are dashed for now after Zverev lost to Tallon Griekspoor in the second round of the BNP Paribas Open. Zverev had come into the tournament as the top seed and a chance to close the gap between him and Italian Sinner, who is serving a three-month ban after testing positive for a banned substance. But despite winning the first set against Griekspoor, Zverev lost 4-6, 7-6 (5), 7-6 (4).","label":"Spam"}
{"text":"Joel Dahmen is in danger of losing his PGA Tour card after being penalized four shots at the Shriners Children’s Open for having too many clubs in his bag.","label":"Spam"}
{"text":"For 17 years, a lake at a golf course in Australia was home to a group of bull sharks, until they mysteriously disappeared.","label":"Spam"}
{"text":"The historic Castle of Antognolla in Italys Umbria region is being transformed into a luxury resort, with a new Six Senses hotel and 17 residences set to open in late 2026. The estate will also feature an 18-hole golf course, with existing facilities including olive groves, vineyards and a 3,000-square-meter wellness center. The region is known for its culture, cuisine and nature, with nearby attractions including medieval towns and the tallest man-made waterfall in Europe.","label":"Spam"}
{"text":"Daniel Ricciardo announced his departure from the RB team with immediate effect; the Australian will be replaced by Liam Lawson, who currently serves as the reserve driver for both Red Bull and RB.","label":"Spam"}
{"text":"Lando Norris won a thrilling race at the Dutch Grand Prix, holding off a competitive Max Verstappen to close the gap in the drivers championship with nine races left this season.","label":"Branding"}
{"text":"Boston Celtics guard Derrick White was injured Thursday night after an inadvertent elbow caused him to lose a tooth, but he was able to recover it and reinsert it and return to the game.","label":"Spam"}
{"text":"Ravens kicker Justin Tucker released a statement, his most extensive comments on the sexual misconduct allegations against him, denying the accusations and saying he never intended to disrespect anyone.","label":"Spam"}
{"text":"Charles Leclerc has yet to win a Formula One world championship, but the Ferrari driver is hopeful that a third attempt will be successful. The 27-year-old has finished second and third in the past two seasons, respectively, and with a new, experienced teammate in Lewis Hamilton, Leclerc is even more motivated for success.","label":"Spam"}
{"text":"Japan scored at the start of each half to defeat the US womens national team 2-1 and win the SheBelieves Cup championship for the first time.","label":"Spam"}
{"text":"In his first game against his former team, Luka Dončić and the Los Angeles Lakers beat the Dallas Mavericks 107-99, with Dončić recording a triple-double. It was a relatively drama-free affair, with Dončić saying he was too tired to feel anything.","label":"Spam"}
{"text":"The 27-year-old tennis player plans to seek her fifth major title – which would be her first since becoming a mother in 2023 – and is looking forward to returning to Las Vegas, where she will face off with women’s world No. 1 Aryna Sabalenka on March 1.","label":"Spam"}
{"text":"American soccer player Crystal Dunn talks about her move to Paris Saint-Germain, her French husband, and their son.","label":"Spam"}
{"text":"The San Antonio Spurs coach has been absent since suffering a mild stroke last year and his future in the NBA is now uncertain, according to ESPN.","label":"Spam"}
{"text":"Bruce Dickinson, frontman of Iron Maiden, participated in a fencing tournament in northern France on Sunday and finished 13th out of 31 competitors in the veterans category.","label":"Spam"}
{"text":"Alexander Zverevs hopes of overtaking Jannik Sinner and becoming the worlds top ranked mens tennis player are over after Zverev lost in the second round of the BNP Paribas Open to Tallon Griekspoor. Zverev had won the first set but ultimately fell 4-6, 7-6 (5), 7-6 (4).","label":"Spam"}
{"text":"From a 16-year-old kid from the north of England to a 58-year-old returning former heavyweight champion of the world, here are the sporting moments that got people talking more than any others in 2024.","label":"Spam"}
{"text":"After coming out on social media, João Lucas Reis da Silva had one of the best weeks of his tennis career. The impact of his post gave him strength on the court, he says.","label":"Spam"}
{"text":"Alexander Zverevs hopes of overtaking Jannik Sinner and becoming the worlds top ranked mens tennis player suffered a serious blow after losing in the second round of the BNP Paribas Open to Tallon Griekspoor.","label":"Spam"}
{"text":"The tight end says he wont make any \"crazy decisions \" about his future after the Chiefs Super Bowl LVII loss.","label":"Spam"}
{"text":"Max Verstappen is poised to win his fourth World Drivers Championship at the Las Vegas Grand Prix, with closest rival Lando Norris title dreams fading. The race, the 22nd of the 2024 Formula One season, gets underway at 10pm PT on Saturday, 1am ET on Sunday. Fans in the US can watch the action on ESPN.","label":"Opportunity"}
{"text":"Jimmy Johnson, the Hall of Fame coach who won two Super Bowls and a college national championship, announced his retirement from Fox Sports on Monday.","label":"Spam"}
{"text":"Novak Djokovics surprise defeat to Botic van de Zandschulp marked his third consecutive defeat, the first time since 2018 the tennis player has suffered such a losing streak.","label":"Spam"}
{"text":"The upcoming 2024 Olympics in Paris is fast approaching but one entrepreneur has a different take on the former motto of the Games, Faster, Higher, Stronger. The Enhanced Games says it is an alternative to the corrupt Olympics Games, however the idea is drawing considerable blowback from sporting organizations and anti-doping officials.","label":"Opportunity"}
{"text":"The Philadelphia Eagles are expected to accept an invitation to visit the White House after winning the Super Bowl, a source with the team told CNN. The Eagles 2018 Super Bowl-winning squad did not visit President Trump.","label":"Spam"}
{"text":"The Philadelphia Eagles are upset that the Green Bay Packers have submitted a proposal to ban a certain running play that the Eagles have had success with.","label":"Spam"}
{"text":"A former Australian motorcycle gang member-turned-golfer earned a spot at The Open Championship after winning the New Zealand Open on Sunday.","label":"Spam"}
{"text":"Catarina Macario opened the scoring for the USWNT before Sentnors second-half strike to seal a 2-0 victory over Colombia in their SheBelieves Cup opener.","label":"Spam"}
{"text":"The former head of the Spanish Football Federation, Luis Rubiales, is on trial for sexual assault and coercion for kissing Womens World Cup winner Jennifer Hermoso on stage. Rubiales denies the kiss was sexual assault.","label":"Spam"}
{"text":"Jannik Sinner has accepted a three-month ban from tennis after he twice tested positive for the banned substance Clostebol in March 2024. The mens world No.1 will be banned from February 9 to May 4, meaning he will be eligible to play in the French Open.","label":"Spam"}
{"text":"A five-star hotel and golf course near the Nepalese capital Kathmandu offers guests the chance to play on a course with deer and leopards.","label":"Opportunity"}
{"text":"TGL, an indoor golf league helped by Tiger Woods and Rory McIlroy, has finally released its schedule and will start in January 2025. The original start date was January 2023, but the schedule was delayed by two years after the venues dome collapsed. Six teams will compete for the SoFi Cup in a 15-match regular season.","label":"Opportunity"}
{"text":"Australia is teeming with wildlife, and its golf courses are no exception, from kangaroos to crocodiles and venomous snakes.","label":"Spam"}
{"text":"Japan scored at the start of each half to defeat the US 2-1 and win the SheBelieves Cup for the first time. It was also the <em>Nadeshikos</em> first-ever victory over the US in 14 attempts, stretching back to 2012.","label":"Spam"}
{"text":"Luis Rubiales, former chief of the Royal Spanish Football Federation, has been acquitted of coercing Womens World Cup winner Jennifer Hermoso into kissing him at an on-field medal ceremony in 2023. However, he was found guilty of the sexual assault and was fined $11,270 and banned from contacting Hermoso for a year.","label":"Spam"}
{"text":"The US Open mixed doubles will be held earlier than usual this year, prompting complaints from players including defending champions Sara Errani and Andrea Vavassori.","label":"Opportunity"}
{"text":"Jessica Pegula, who won the ATX Open, has earned praise on social media for her generosity towards her fellow players. Following her victory, Pegula offered her private jet to players competing in the tournament so they could avoid a late-night trip to California for the Indian Wells competition.","label":"Spam"}
{"text":"Sergio Garcia has applied to rejoin the DP World Tour after paying his fines for joining the LIV Golf circuit, which makes him ineligible to play on the DP Tour. The Ryder Cup enthusiast and 2017 Masters champion will not be able to participate in the DP World Tour next year as he will have to serve his suspensions.","label":"Spam"}
{"text":"A record 45 million people played golf in the US last year, and there were another 31.6 million unregistered and registered golfers across 146 countries in 2023, too.","label":"Opportunity"}
{"text":"Max Verstappen took his ninth victory of the 2024 Formula One season at the Qatar Grand Prix, but the Red Bull driver was in a sour mood, accusing Mercedes George Russell of trying to \"screw him over \" after a contentious qualifying session.","label":"Spam"}
{"text":"Charles Leclerc held on to win the Italian Grand Prix in front of a huge and passionate home crowd. His Ferrari teammate Carlos Sainz finished second, with McLarens Oscar Piastri coming in third. The result means that Leclerc has now won two of his favourite races - Monaco and Italy. It was a disappointing day for McLarens Lando Norris, who suffered from mistakes and bad strategy, finishing down in sixth place.","label":"Spam"}
{"text":"Lando Norris took the Singapore Grand Prix victory with a comfortable win, cutting Max Verstappens lead in the drivers world championship. It was McLarens first 1-2 finish since the 2013 Australian Grand Prix, with Oscar Piastri coming in third. The team now leads the constructors championship.","label":"Spam"}
{"text":"Washington Commanders will trade for star receiver Deebo Samuel from the San Francisco 49ers, pending a physical, according to reports. Samuel appeared to acknowledge the trade on Instagram, posting a highlight reel of his time in San Francisco.","label":"Spam"}
{"text":"Novak Djokovics surprise defeat to Botic van de Zandschulp marked his third consecutive defeat, the first time since 2018 the tennis player has suffered such a losing streak.","label":"Spam"}
{"text":"Alexander Zverevs hopes of overtaking Jannik Sinner and becoming the worlds top ranked mens tennis player are fading fast after a shock defeat in the second round of the BNP Paribas Open.","label":"Spam"}
{"text":"Two young female athletes died by suicide after suffering <a href=\"https://www.cnn.com/travel/article_gallery/asia/japan/tokyo-2020/olympics/sports-concussion-and-mental-health/index.html \" target=\"_blank\">concussion</a>, and <a href=\"https://www.cnn.com/2022/06/16/sport/women-in-sports-funding-diversity/index.html \" target=\"_blank\">lack of support</a> for their injuries.","label":"Spam"}
{"text":"Japan scored at the start of each half to beat the US 2-1 and win the SheBelieves Cup for the first time. It was the Nadeshikos first-ever victory over the US in 14 matches, stretching back to 2012.","label":"Spam"}
{"text":"The 35-year-old ended a tumultuous year with his third win on the DP World Tour Championship in Dubai, his sixth win at the Race to Dubai.","label":"Spam"}
{"text":"Charles Leclerc held on to take the checkered flag at the Italian Grand Prix in front of a huge crowd of delirious Ferrari fans.","label":"Spam"}
{"text":"Former MLB star Alex Rodriguez sinks half-court basket, winning $10,000 for Bucknell student during halftime of Sundays game against Army.","label":"Spam"}
{"text":"Baileigh Sinaman-Daniel has become the first NCAA Division III womens basketball player with one arm to score a field goal in a collegiate game. The Lesley University player scored on December 4 against Fitchburg State.","label":"Spam"}
{"text":"The Italian soccer player Moise Kean, 24, has been discharged from hospital after collapsing in a game on Sunday. The striker received treatment before being stretchered off following a collision. He spent the night in hospital in Verona as a precaution.","label":"Spam"}
{"text":"The 2026 World Cup final, hosted in the US, will include a halftime show for the first time, FIFA president Gianni Infantino has confirmed. The final will take place at New Jerseys MetLife Stadium on 19 July 2026. Coldplay and Global Citizen will help produce the show, according to Infantino.","label":"Opportunity"}
{"text":"Australian golfer Jeffrey Guan was left blinded in one eye after being struck in the face by a golf ball. The 20-year-old was making his PGA Tour debut when he was hit.","label":"Spam"}
{"text":"Seven-time F1 world champion Lewis Hamilton is feeling \"invigorated \" ahead of his first season with iconic Ferrari, saying its like \"realizing my dream\". Hamilton, 40, will race alongside Charles Leclerc, with the team hoping to secure its first drivers championship since 2007.","label":"Spam"}
{"text":"Former NFL punter Chris Kluwe said he was fired from his job as a high school football coach following his protest at a local council meeting in California against the MAGA slogan.","label":"Spam"}
{"text":"Max Verstappen claimed his fourth consecutive Formula One World Drivers Championship at the Las Vegas Grand Prix on Sunday, with George Russell taking victory for Mercedes.","label":"Branding"}
{"text":"Marty Sheargold, a radio host and comedian, has been fired from his role on the Marty Sheargold Show on Triple M radio after a misogynistic rant about the Australian womens soccer team, Matildas. The radio host has since apologised for the comments on Instagram, but the national soccer governing body, Football Australia, has called the remarks \"unacceptable\".","label":"Spam"}
{"text":"The former head of the Spanish Football Federation, Luis Rubiales, is on trial for sexual assault and coercion for kissing Womens World Cup winner Jennifer Hermoso on stage. Hermoso has said that the kiss was not mutual and that Rubiales did not have her consent.","label":"Spam"}
{"text":"The PGA of America is facing criticism for the steep prices of tickets to the 2025 Ryder Cup, with some pointing out that it could affect the atmosphere of the event.","label":"Opportunity"}
{"text":"For a time, Carbrook golf club in Queensland, Australia had a uniquely dangerous water hazard: a lake that was home to a group of bull sharks. The sharks arrived in the 1990s and lived in the lake for 17 years before their disappearance.","label":"Spam"}
{"text":"Heading into the 2024 Formula One season, many fans feared it would be more of the same, but this year has been anything but boring. Here are five moments to remember.","label":"Spam"}
{"text":"The Boston Celtics defeated the Los Angeles Lakers on Saturday night, ending the Lakers eight-game winning streak. The Lakers suffered another loss as well, as LeBron James left the game with a groin injury.","label":"Spam"}
{"text":"Charles Leclerc has yet to win a Formula One world championship, but the Ferrari driver is confident he can achieve his dream in 2025. The 27-year-old Monégasque has finished second and third in the last two seasons and is targeting victory in the upcoming campaign. Red Bulls Max Verstappen is the defending champion, but Leclerc believes he can challenge the Dutchman if he continues to improve.","label":"Spam"}
{"text":"Angel Cabrera, a two-time major winner, will be returning to the Masters next month after serving two years in prison for domestic abuse.","label":"Spam"}
{"text":"Brian Campbell took 10 years to win his first tournament, thanks in part to a slice of luck with a stroke of bamboo. The golfer will now compete at prestigious tournaments including the Masters.","label":"Spam"}
{"text":"Michelle Cooper scored the winner as the US beat Australia to set up a final-game showdown with Japan in the SheBelieves Cup; Japan scored the fastest goal in the competitions history on its way to a 4-1 win over Colombia.","label":"Spam"}
{"text":"Simona Halep announced her tennis retirement on Tuesday following a doping ban and subsequent injuries that impacted her performance. Halep won two Grand Slam titles during her career.","label":"Spam"}
{"text":"Dallas Mavericks star Kyrie Irving has suffered a torn ACL in his left knee, an injury that is likely to see him miss the rest of the NBA season, the team announced Tuesday.","label":"Spam"}
{"text":"Saturdays college basketball action saw Alabama and St. Johns seal victory in their final regular season games in dramatic style with overtime buzzer-beaters.","label":"Spam"}
{"text":"Here’s the field for the 2025 NCAA men’s basketball tournament","label":"Spam"}
{"text":"From ‘scrawny’ teenager to ‘ultimate competitor,’ Yared Nuguse’s wild, unexpected journey to the top of running","label":"Spam"}
{"text":"NFL free agency kicks off with a flurry of big moves","label":"Opportunity"}
{"text":"Rare, disallowed penalty causes controversy as Real Madrid beats Atlético Madrid in Champions League last 16", "label":"Branding"}
